{
  "Barkley Plumbing and Septic (ChIJvyeTdRotvG8RkmIklJ97REQ)": [
    {
      "reviewer_name": "tom perrine",
      "text": "Ethan came out when he said he was. Actually  earlier.  He fixed my plumbing  issues in a timely  manner.  I would use him again for any future  plumbing  needs.",
      "date": "2025-01-23",
      "stars": 5
    },
    {
      "reviewer_name": "Molly Dutton",
      "text": "Came when he said he would and very quick to respond to messages. Appreciate him addressing my concerns and getting us fixed up.",
      "date": "2024-12-13",
      "stars": 5
    },
    {
      "reviewer_name": "Holden Smith",
      "text": null,
      "date": "2024-12-12",
      "stars": 5
    },
    {
      "reviewer_name": "Alan Bowman",
      "text": "Ethan repaired a leaky faucet and replaced a toilet for our home. Ethan was professional and worked in a timely manner. Highly recommended!",
      "date": "2024-12-03",
      "stars": 5
    },
    {
      "reviewer_name": "Charlotte Seats",
      "text": "I recommend Ethan Barkley Plumbing for all your plumbing needs. He is very trustworthy & does great quality work. Ethan was quick to come out & fix my water leak. I would rate his service a 5 Star!  Jerry Seats",
      "date": "2024-11-07",
      "stars": 5
    },
    {
      "reviewer_name": "Keelin Fullen",
      "text": "My landlord wouldn’t fix my sink, and Mr Barkley was my saving grace… he got it fixed right up with a fast and quality service",
      "date": "2024-08-24",
      "stars": 5
    },
    {
      "reviewer_name": "Amber Morgan",
      "text": "Highly recommend Barkley Plumbing and Septic. I had a line from my hot water heater leaking in my attic and Ethan was able to replace the entire water line by the next day for a fair price.",
      "date": "2024-08-03",
      "stars": 5
    },
    {
      "reviewer_name": "Sammy Waller",
      "text": "Ethan is very personable and does neat work. Reasonable pricing for a last minute kitchen sink install. I have a new plumber.",
      "date": "2024-06-29",
      "stars": 5
    },
    {
      "reviewer_name": "Chance Austin",
      "text": "Needed a new kitchen faucet installed, called Ethan on a Wednesday night and he was there Thursday morning. Did great work for a fair price and easily the best Plummer I have dealt with.  I would recommend Ethan to anyone in need of quick and quality work.",
      "date": "2024-06-29",
      "stars": 5
    },
    {
      "reviewer_name": "Tanner Cecil",
      "text": "Broke a water spigot while washing my truck. Called Barkley plumbing and he was able to come out within the next hour and got me fixed up quick. Great quality work and in a timely manner! Thank you!",
      "date": "2024-06-29",
      "stars": 5
    },
    {
      "reviewer_name": "AmericanPride 1776",
      "text": "I came home to a broke water faucet for my washer machine. These guys came out quick and were able to get me taken care of without breaking the bank. Will use again.",
      "date": "2024-06-26",
      "stars": 5
    },
    {
      "reviewer_name": "David Rogers",
      "text": "Very respectful and does quality work",
      "date": "2024-06-26",
      "stars": 5
    }
  ],
  "Johnny Thomas Plumbing (ChIJJUc7qlIm1IcRx-cCCiI_yP0)": [
    {
      "reviewer_name": "Gary M",
      "text": "Didn't finish the job and didn't stay in contact with me. It's like he didn't care. I wouldn't recommend his services.",
      "date": "2024-10-08",
      "stars": 1
    },
    {
      "reviewer_name": "Diana Moore / Turner",
      "text": "Do Not call this man,my mother made that mistake,she needed a faucet fixed,he charged my mother who is in her 70\"s ,$432.50. ,charged her $110.00 for his self $110.00 for the young boy who he said was in training and stood there doing nothing, charged her $85.00 to go get a seal, from Black Rock to Pocahontas ,material and gas$127.00. and the faucet still isn't fixed.WOW...",
      "date": "2024-01-23",
      "stars": 1
    },
    {
      "reviewer_name": "Susan Haley",
      "text": null,
      "date": "2023-11-10",
      "stars": 5
    },
    {
      "reviewer_name": "Rebecca Belt",
      "text": null,
      "date": "2023-10-01",
      "stars": 1
    },
    {
      "reviewer_name": "Michelle Metcalf",
      "text": null,
      "date": "2023-09-30",
      "stars": 1
    },
    {
      "reviewer_name": "Michelle Metcalf",
      "text": null,
      "date": "2023-09-29",
      "stars": 1
    },
    {
      "reviewer_name": "Rachel Jordan",
      "text": "Johnny is by far the best around. He’s always so sweet and does an amazing job. I wouldn’t trust anyone else. If you need a plumber he’s the best!",
      "date": "2023-03-13",
      "stars": 5
    },
    {
      "reviewer_name": "Melvina Hunt",
      "text": "They done a real good job and was very nice",
      "date": "2023-03-09",
      "stars": 5
    },
    {
      "reviewer_name": "kerryncasey stevens",
      "text": "Number disconnected left a note no reply...",
      "date": "2022-09-15",
      "stars": 1
    },
    {
      "reviewer_name": "Gary Walker",
      "text": "Put in a gas line for our new gas fireplace. Done a good job. Highly recommend him.",
      "date": "2022-08-06",
      "stars": 5
    },
    {
      "reviewer_name": "Sandy Morris",
      "text": "Could not get him to return calls or show up",
      "date": "2022-06-02",
      "stars": 1
    },
    {
      "reviewer_name": "Joseph Carpenter",
      "text": "Absolutely the best! with all the bad luck going on with my house it was a very big relief having somebody come out to do the job and be done and only minutes it was awesome they were very nice and worked with a smile. very much appreciate them. I will no longer try to do plumbing myself. these are are my go to guys from here on out.",
      "date": "2022-05-24",
      "stars": 5
    },
    {
      "reviewer_name": "syvilla priest",
      "text": null,
      "date": "2021-11-15",
      "stars": 5
    },
    {
      "reviewer_name": "MelNLavon Patterson",
      "text": "They did great! Cleaned everyone of our pipes, made everything drain great & fixed the problem! Would 100% use them again! They did amazing!",
      "date": "2021-06-15",
      "stars": 5
    },
    {
      "reviewer_name": "Travis Middlecoff",
      "text": "All of my pipes were backing up causing a huge mess. They came out quickly and got the job done! Extremely friendly, great service, quick, knowledgeable and also communicated what was going on throughout working the job. I was worried the price would be high, as most plumbers/repairmen are, but the price was more than reasonable! I’m highly satisfied, and all of these positive reviews are well deserved. I will use and recommend Johnny Thomas for all future plumbing needs!",
      "date": "2020-12-29",
      "stars": 5
    },
    {
      "reviewer_name": "shawna clements",
      "text": "Good people did amazing job with my plumbing work recommended them to anyone they was on time very professional andover all great service I will use them again if I ever need have plumbing issues again",
      "date": "2020-06-09",
      "stars": 5
    },
    {
      "reviewer_name": "Lexi Buckwalter",
      "text": "They were so nice while they were here. They got back to me quickly and  they made sure that my problem was fixed. They didn't charge me a ton of money and they did so good fixing my problem. I had several people turn me down when I called. They were the only ones who would help me and they were amazing.",
      "date": "2020-04-22",
      "stars": 5
    },
    {
      "reviewer_name": "Ericka Carter",
      "text": "These men were incredible.... they were very informative of what was going on with my sewer line and they were really nice and very professional. I recommend them to anyone looking for a trusty plumber.",
      "date": "2020-03-25",
      "stars": 5
    },
    {
      "reviewer_name": "Corey Gilliland",
      "text": null,
      "date": "2020-03-23",
      "stars": 5
    },
    {
      "reviewer_name": "Carol Arnold",
      "text": "They were professional and nice. I will be using them for all my plumbing work!",
      "date": "2020-03-18",
      "stars": 5
    },
    {
      "reviewer_name": "Kira Hand",
      "text": "Great service, fast and friendly! Will use for all plumbing needs!!",
      "date": "2020-03-12",
      "stars": 5
    },
    {
      "reviewer_name": "Lucas Heer",
      "text": null,
      "date": "2020-03-11",
      "stars": 5
    },
    {
      "reviewer_name": "Shaun Thomas",
      "text": null,
      "date": "2020-02-26",
      "stars": 5
    }
  ],
  "David's Fast Emergency Plumbing (ChIJ-whw30ec1ocRV6TF2A7qwmk)": [
    {
      "reviewer_name": "Rhonda Pattillo",
      "text": null,
      "date": "2023-04-12",
      "stars": 5
    },
    {
      "reviewer_name": "Joyce Roberts",
      "text": "He didn't fix the problem the first time and had to come back, yet he charged me twice.",
      "date": "2023-01-08",
      "stars": 1
    },
    {
      "reviewer_name": "Marie Taggart",
      "text": "Refused to come out in an emergency.  I wish I could give zero stars. 👎",
      "date": "2021-02-19",
      "stars": 1
    }
  ],
  "Elliot Plumbing Company (ChIJH1S2OdEr1IcRXxOY6as7lZg)": [
    {
      "reviewer_name": "Bob Dyess",
      "text": null,
      "date": "2018-10-20",
      "stars": 3
    }
  ],
  "Ogles Plumbing (ChIJT71U02aC1ocRebpED6PNcWE)": [
    {
      "reviewer_name": "Darrick Gore",
      "text": "I give this company a five star rating. They were on time and very flexible with answers and payment of the job. Superb work!!!",
      "date": "2023-12-09",
      "stars": 5
    },
    {
      "reviewer_name": "Brad Dyer",
      "text": "Honest dependable service at a reasonable price",
      "date": "2023-03-05",
      "stars": 5
    },
    {
      "reviewer_name": "Mable See Olson",
      "text": "We called them and finally talk to one and they said they would be out but never came out its been over two weeks and no phone call back or showen up. They use to be great and this has never happen in the past .first time",
      "date": "2023-01-31",
      "stars": 1
    },
    {
      "reviewer_name": "Amy Campbell",
      "text": null,
      "date": "2021-12-08",
      "stars": 5
    },
    {
      "reviewer_name": "Darold jr Ogles",
      "text": null,
      "date": "2021-07-30",
      "stars": 5
    },
    {
      "reviewer_name": "Doris Franklin",
      "text": "Does the job right the first time for the best price.",
      "date": "2020-01-31",
      "stars": 5
    },
    {
      "reviewer_name": "taylor harris",
      "text": "Does great plumbing very reasonable and reliable",
      "date": "2018-07-09",
      "stars": 5
    },
    {
      "reviewer_name": "david_ kg1984",
      "text": "We are building a home and ogles plumbing did the plumbing. They were off on two sinks, two toilets and one bath tub. That is several measurements to be off. We were going to do stained concrete in two of the bathrooms but have to tile now because we had to jack-hammer the concrete. I would not recommend ogles to anybody.",
      "date": "2018-05-17",
      "stars": 1
    },
    {
      "reviewer_name": "Ed X",
      "text": null,
      "date": "2018-01-12",
      "stars": 1
    }
  ],
  "Chris Magness Plumbing (ChIJs7AAYjsp1IcRd1qa1OgBeks)": [
    {
      "reviewer_name": "Anonymous",
      "text": "",
      "date": "Unknown date",
      "stars": 0
    }
  ],
  "Two Guys Plumbing Inc. (ChIJlfq9EDop1IcRyLTYZdiMl-k)": [
    {
      "reviewer_name": "Clint Jackson",
      "text": "Tanner took care of my new construction plumbing quickly and professionally. I highly recommend him for plumbing custom homes.",
      "date": "2025-01-03",
      "stars": 5
    },
    {
      "reviewer_name": "Brandon Haley",
      "text": "These guys are great. Showed up and showed out! Had my sink fixed in about an hour and it looks so much better I’d recommend them to anyone.",
      "date": "2023-03-05",
      "stars": 5
    }
  ],
  "Superior Plumbing (ChIJ583lFvgr1IcR9RH9RZkUnxg)": [
    {
      "reviewer_name": "Madison Griffin",
      "text": "Great job and great guys! They knocked out our plumbing work for our house so quick and good! Better communicators than most the other construction people!",
      "date": "2024-09-12",
      "stars": 5
    },
    {
      "reviewer_name": "Loren Allison",
      "text": null,
      "date": "2023-03-24",
      "stars": 3
    },
    {
      "reviewer_name": "Dana Simpkins",
      "text": "I would recommend to anyone!",
      "date": "2020-12-18",
      "stars": 5
    },
    {
      "reviewer_name": "Gabriel Black",
      "text": "Unbelievably bad. Horrible communication. No showed on commercial project for weeks could never get ahold of him. Matt Parnell said he was gonna submit our permits and never did. Never heard back till I called office and put us way way behind schedule on opening. DONT NOT USE THESE PEOPLE.",
      "date": "2019-12-09",
      "stars": 1
    },
    {
      "reviewer_name": "Joshua Byard",
      "text": "BEWARE!!! Very unprofessional. They finished the final portion of the job four days ago and text me at 9:55pm to tell me they are placing a lien on my construction site if I didn't pay them by noon the next day. Poor customer service. Took two months to get them to finish the job. I had to call multiple times, and they wouldn't return my calls. DON'T CALL THEM.",
      "date": "2019-08-23",
      "stars": 1
    },
    {
      "reviewer_name": "Kasie Fagan",
      "text": null,
      "date": "2019-05-27",
      "stars": 5
    },
    {
      "reviewer_name": "Amanda Jones",
      "text": "Very nice environment and the people are very helpful",
      "date": "2018-10-07",
      "stars": 5
    }
  ],
  "Mid-South Heat & Air (ChIJB-SmCwN91ocRDZkEqljH12c)": [
    {
      "reviewer_name": "Jonathan “Suttonio” Sutton",
      "text": "Great people, fantastic work, trustworthy for multiple reasons:\n\nCalled them due to, what I would describe as, a scratching noise coming from my return vent whenever unit was running. Called Aaron and they came right over, pulled the part and commenced to explain what was going on. At the time I didn’t have the money but despite all that they treated me like a paying customer. Even telling me if it goes out over LABOR DAY WEEKEND, of all weekends, we have options. Just call us. Glad it didn’t come to that. When I came up with the money for them to order and fix the issue they came right over. They kept me informed during the whole process, went above and beyond to check for other issues. They have been to my house multiple times and are always very courteous and willing to explain, in detail, the issues you’re having and how they are going to rectify them. Problem is most ppl don’t listen, but I digress. They don’t leave a mess as you can see from the picture, they went out of their way to maintain cleanliness and that’s much appreciated and most of the time overlooked and under praised. They even came today when my son was sleeping and managed to maneuver around quiet enough to where he didn’t even wake up till he finished his nap. I’m not sure how. Fair prices, good work, nice people. Will not be using anyone else, these guys are good to have in your contact list.",
      "date": "2024-09-04",
      "stars": 5
    },
    {
      "reviewer_name": "Travis Thacker",
      "text": "Did a good job and got my furnace fixed in no time!",
      "date": "2024-01-19",
      "stars": 5
    },
    {
      "reviewer_name": "Courtney Stringer",
      "text": null,
      "date": "2023-08-21",
      "stars": 5
    },
    {
      "reviewer_name": "Robert Schulze",
      "text": null,
      "date": "2023-08-20",
      "stars": 1
    },
    {
      "reviewer_name": "Jonathan Keasler",
      "text": "Our work office was constantly hotter than outside. 80 degrees outside, 85 in the office.\nAfter just a few hours, it holds a steady 65!! Even with the doors constantly in use. Work life this summer will no longer be miserable!!\nThank you from all of us at NEAR Ready Mix Paragould, AR.",
      "date": "2023-07-12",
      "stars": 5
    },
    {
      "reviewer_name": "Danna Lee Holt",
      "text": "These folks were on time, efficient, professional, personable, and best of all they provide quality services! We are incredibly grateful for ya'll and to finally be able to escape the heat and cool down!! Thank ya'll so very much for your time and energy!!\n-The Near Ready Mix Paragould Plant",
      "date": "2023-07-12",
      "stars": 5
    },
    {
      "reviewer_name": "cathy hall",
      "text": "They show up when they say, usually the same day.  Everything is good when they leave.  They clean up after themselves.",
      "date": "2023-05-17",
      "stars": 5
    },
    {
      "reviewer_name": "Josh Dowler",
      "text": null,
      "date": "2023-04-11",
      "stars": 5
    },
    {
      "reviewer_name": "Marwan Grera",
      "text": "Great people, had a project they don't the kind I want but helped me with great information and connecting me with who can help me. I recommend highly",
      "date": "2023-02-07",
      "stars": 5
    },
    {
      "reviewer_name": "Tripp",
      "text": "Great guy, very informative and helpful with information. Will be using in the future.",
      "date": "2022-03-24",
      "stars": 5
    },
    {
      "reviewer_name": "David m Manley",
      "text": "He has a good repair service.",
      "date": "2022-01-04",
      "stars": 5
    },
    {
      "reviewer_name": "Curtis Burns",
      "text": "Wonderful they were so nice ..and more then fair",
      "date": "2021-12-15",
      "stars": 5
    },
    {
      "reviewer_name": "Kelly Roberts",
      "text": "Amazing people, so happy to have them as my go to company now! Thank you",
      "date": "2021-06-23",
      "stars": 5
    },
    {
      "reviewer_name": "John Green",
      "text": "My outside AC fan stopped and I needed a specific capacitor after 5 pm on a weekday. This business owner let me come pick up from his shop same day and it fixed my problem. He also followed up next day to make sure that it indeed fixed it. Very nice guy. Highly recommended",
      "date": "2021-06-16",
      "stars": 5
    },
    {
      "reviewer_name": "Dustin Dancer",
      "text": "Called to get on the schedule, they came within an hour to fix the issue. Very quick and professional. Would recommend for sure.",
      "date": "2021-04-14",
      "stars": 5
    },
    {
      "reviewer_name": "Chris Salehi",
      "text": "Absolutely amazing company to work with.  Always on time and answers all the questions you have. Very reasonable and friendly.",
      "date": "2021-03-02",
      "stars": 5
    },
    {
      "reviewer_name": "Josh Wise",
      "text": "Great service! They answered my call on a Saturday as soon as I called in the morning. They said they could check my issue that afternoon which they did. They kept me up to date on when they were on their way to my house and when my part came in, the cost, and with any questions I had. They had my air handler unit up and going in 30 minutes. I tried contacting 7 or so HVAC businesses in Paragould that day and only two answered my call. Mid-South was the only one that could help me, the other couldn't get a tech to me, but actually recommended me to call Mid-South. The others that I could leave messages with haven't even returned my call still. I'll use Mid-South again for sure!",
      "date": "2020-12-31",
      "stars": 5
    },
    {
      "reviewer_name": "Matthew McFadden",
      "text": null,
      "date": "2020-07-20",
      "stars": 5
    },
    {
      "reviewer_name": "Keith Vangilder",
      "text": "Had one of our old air conditioners go out. Aaron promptly come out and try to put a bandaid on it until we could get it fixed. I knew it needed to be replaced but he still took the time to show us options and in the end was able to match our existing units. Literally charged half of the other people we called for a quote. I won’t be calling anyone else.",
      "date": "2020-07-18",
      "stars": 5
    },
    {
      "reviewer_name": "Shane Williams",
      "text": "These guys are the best, very nice, reasonably priced, knowledgeable, on time and had to fix the last guy's mistake on my unit, I have nothing but great things to say about this business and will definitely be using them again, thanks guys.",
      "date": "2020-06-29",
      "stars": 5
    },
    {
      "reviewer_name": "Rachel South",
      "text": "Called to get a quote on diagnosing an issue with my HVAC, and they came within the hour to fix the issue. Very quick, professional, and friendly. Would definitely use again.",
      "date": "2020-06-19",
      "stars": 5
    },
    {
      "reviewer_name": "Verlis Guinn",
      "text": "Aaron came right out and fixed our heat pump on a Saturday!  He's a friendly fella and he took the time to explain what he was doing. Breath of fresh air! Don't hesitate to call him if you have some AC/Heat issues.",
      "date": "2020-03-16",
      "stars": 5
    },
    {
      "reviewer_name": "Caitlin Owens",
      "text": "Our ac went out in the middle of summer. They came out the very next day after I called them and worked till around 9pm trying to fix it. There was another part that was messed up so they had to come back the next day(not at all their fault). He was very friendly and professional. The price was 200 to 300 less than most of the other places I called. I will definitely use them again in the future!",
      "date": "2020-01-15",
      "stars": 5
    },
    {
      "reviewer_name": "James Safirt",
      "text": "Highly recommend.  Was nice and friendly and took great care to insure that we got exactly what we needed.",
      "date": "2019-10-24",
      "stars": 5
    },
    {
      "reviewer_name": "Nikki Parrish",
      "text": "I called the morning after my unit went out and there was a repair man at my house within an hour. Very quick and professional! Wonderful service and good pricing, highly recommend",
      "date": "2019-10-04",
      "stars": 5
    },
    {
      "reviewer_name": "Mandy Cox",
      "text": "Called him he was at my house within 30 mins had my air fixed within the hour and you came beat his prices. Definitely  recommend him. You can call him and he will help u any way he can overall awesome",
      "date": "2019-07-07",
      "stars": 5
    },
    {
      "reviewer_name": "Jonathan Shick",
      "text": "Very friendly and would recommend. Thanks again!",
      "date": "2019-07-07",
      "stars": 5
    },
    {
      "reviewer_name": "Cody Oldham",
      "text": "My family has dealt with MSHA since they opened. They came out and fixed the issue on site and for a better price than we had even been quoted. The work was great and fast and we have had no issues since. I would highly recommend MSHA to anyone!",
      "date": "2019-07-05",
      "stars": 5
    },
    {
      "reviewer_name": "Bradley Burns",
      "text": "Great service, came out ,very positive  ,I was told by other ac companies that i need a new unit, he came and checked my system and it was a just a bad connection, saved me thousands of dollars .  Thank you very much",
      "date": "2019-07-05",
      "stars": 5
    },
    {
      "reviewer_name": "Angela Dorsey",
      "text": "Great work. Fast responce time. Reasonable pricing. Will definitely use them again.",
      "date": "2019-07-05",
      "stars": 5
    },
    {
      "reviewer_name": "Shelley Hale",
      "text": "Very helpful and honest person!",
      "date": "2019-05-26",
      "stars": 5
    },
    {
      "reviewer_name": "Tj Williams",
      "text": "Great work! Good prices! Best around!!!",
      "date": "2019-04-02",
      "stars": 5
    },
    {
      "reviewer_name": "Amanda Horton",
      "text": "Very realible, friendly service. The  job is always complete and done right! Definitely recommend their services and the prices can't be beat !",
      "date": "2019-04-02",
      "stars": 5
    },
    {
      "reviewer_name": "Mars The Menace",
      "text": "Nice guy and it didn't take him long either 👌👌",
      "date": "2019-04-02",
      "stars": 5
    },
    {
      "reviewer_name": "Shane Baldwin",
      "text": "Had a fan quit working on an older model air handler. Aaron was there within 15 minutes and had everything fixed and back up and running that afternoon. Would definitely recommend him to anyone.",
      "date": "2019-01-24",
      "stars": 5
    },
    {
      "reviewer_name": "Sheila Overton",
      "text": "Aaron was very prompt, professional, and honest fixing our unit at a reasonable price. We will call him again for any heat and air problems",
      "date": "2018-12-04",
      "stars": 5
    },
    {
      "reviewer_name": "Karen Miller",
      "text": "He came and fixed my system after hours and worked with me on the price. I would definitely use midsouth again.",
      "date": "2018-11-08",
      "stars": 5
    },
    {
      "reviewer_name": "Jeff Clay",
      "text": "Aaron has done a great job keeping our heat and air system running strong. He's very prompt, polite and knowledgeable.",
      "date": "2018-11-08",
      "stars": 5
    },
    {
      "reviewer_name": "Dottie Wikowsky",
      "text": "We called Aaron (owner of Mid-South Heat & Air.  He came out that day and fix our air.  Great job.  He was helpful and informative.  We will call again if we need service",
      "date": "2018-10-19",
      "stars": 5
    },
    {
      "reviewer_name": "Matt Lawrence",
      "text": "Great customer service and reasonable pricing.",
      "date": "2018-10-07",
      "stars": 5
    }
  ],
  "All In One Services (ChIJjy8EKfM7X6cRjVVNorsmQT0)": [
    {
      "reviewer_name": "Maal",
      "text": "I needed my A/C unit worked on during the hottest month of the year. They came out & put some electrical tape on my outside unit. My indoor unit is still leaking. They said they would get back to me about resolving the issues & never did. Just stopped answering my calls & emails. I’ve truly never been more disappointed. If you are looking for professionalism & customer service, I don’t think you will find it here.",
      "date": "2024-09-30",
      "stars": 1
    },
    {
      "reviewer_name": "Phyllis Stone",
      "text": "Came to the house on Saturday afternoon , we called and they called back very quick about fixing our air conditioning unit . The young was very knowledgeable about the matter and told us it wasn’t the air conditioner it was something to do with the electric coming into our house. Very nice young man that we would recommend and will us them again when needed.",
      "date": "2024-06-01",
      "stars": 5
    },
    {
      "reviewer_name": "Brian Etheridge",
      "text": "The best service I've had since owning the home of ten + years. Thanks. And your company will be recommended in the future.",
      "date": "2024-05-17",
      "stars": 5
    },
    {
      "reviewer_name": "Stefani May",
      "text": "Answer phone quickly,reasonable, professional, did a great job on putting new duct system. Recommend them to anyone that needs service.",
      "date": "2024-03-29",
      "stars": 5
    },
    {
      "reviewer_name": "tammy anderson",
      "text": null,
      "date": "2024-03-05",
      "stars": 5
    },
    {
      "reviewer_name": "Beth Davis",
      "text": "Called him he immediately fixed my brothers hot water heater within the hour he was very professional bought everything took old water heater off answered the phone quickly I couldn’t ask for any better service period I highly recommend him!!!",
      "date": "2024-02-22",
      "stars": 5
    },
    {
      "reviewer_name": "Dawn Ferguson",
      "text": "They were very polite, professional and prompt to respond to in home call.\nI would Definitely call them again if I had any troubles",
      "date": "2023-11-01",
      "stars": 5
    },
    {
      "reviewer_name": "Zack Rodgers",
      "text": "Called for my AC going out. They got to the house in an impressive timely manner. Very professional and had the issue fixed within no time. Will definitely use thier services in the future and highly recommend them to anyone. Very cost friendly as well.",
      "date": "2023-06-05",
      "stars": 5
    },
    {
      "reviewer_name": "Coleman James",
      "text": "These guys were fast, efficient, and reasonable. And they actually answer their phone, which is rare around here. They fixed my water heater in no time. Awesome job; highly recommended.",
      "date": "2023-03-02",
      "stars": 5
    }
  ],
  "JVT Remodeling & Home Service (ChIJNyZXsmBpW2YRLcv2JrAFnWU)": [
    {
      "reviewer_name": "Jillian Taylor",
      "text": "Incredible young man! Very honest and reliable.",
      "date": "2024-09-20",
      "stars": 5
    }
  ],
  "King Plumbing (ChIJEzJ4v1mA1ocRaY-rj8LgkBY)": [
    {
      "reviewer_name": "Johnny Birdsong",
      "text": "Never returned call",
      "date": "2024-11-20",
      "stars": 1
    },
    {
      "reviewer_name": "Dusten Lee",
      "text": "Quick and fast gets in and gets out and get the job done right",
      "date": "2024-06-18",
      "stars": 5
    },
    {
      "reviewer_name": "Tina Hefner",
      "text": "Brad King is a very good and honest plumber...get the job done right the first time...",
      "date": "2018-02-02",
      "stars": 5
    }
  ],
  "Williams plumbing jonesboro (ChIJFbjK3kEo1IcRtoCLhZFVyI4)": [
    {
      "reviewer_name": "C Raanes",
      "text": "This man took 1800.00 and ran. Never finished the job. I have been with out heat and hot water for 3 weeks. No body else will touch his work. I am going to have to pull out my gas hot water heater and my gas furnace and run all new electric because of this man. Do not use him",
      "date": "2023-10-19",
      "stars": 1
    }
  ],
  "None (None)": [
    {
      "reviewer_name": "Anonymous",
      "text": "",
      "date": "Unknown date",
      "stars": 0
    }
  ],
  "B&J handyman service (ChIJ8ygZxqaC1GURwDKLlfobyrM)": [
    {
      "reviewer_name": "Anonymous",
      "text": "",
      "date": "Unknown date",
      "stars": 0
    }
  ],
  "Speakes Electric (ChIJgVQfYY9_1ocRLin9D9fv-nE)": [
    {
      "reviewer_name": "Bobby Williams",
      "text": "Great service",
      "date": "2022-07-12",
      "stars": 5
    },
    {
      "reviewer_name": "Robert Brannan",
      "text": null,
      "date": "2019-11-23",
      "stars": 5
    },
    {
      "reviewer_name": "Tierre Hamilton",
      "text": null,
      "date": "2019-08-30",
      "stars": 5
    },
    {
      "reviewer_name": "Roy O'Neal",
      "text": null,
      "date": "2019-03-17",
      "stars": 1
    }
  ],
  "JD Plumbing LLC (ChIJC5JUq2hp1ocR8zmk7hNY6Po)": [
    {
      "reviewer_name": "Kelbe Dowler",
      "text": null,
      "date": "2023-06-19",
      "stars": 5
    }
  ],
  "Unity Enterprises of Northeast Arkansas (ChIJi4da6Vwp1IcR0bX5offer6g)": [
    {
      "reviewer_name": "Kevin Ross",
      "text": "Very affordable great work and in good time. Would use again and recommend to anyone.",
      "date": "2022-04-26",
      "stars": 5
    },
    {
      "reviewer_name": "Zaiden Kent",
      "text": null,
      "date": "2022-04-07",
      "stars": 5
    },
    {
      "reviewer_name": "Missouri Home Inspections by Clinton Carter",
      "text": "Excellent work remodeling and tiling  the shower and bathroom and great at communicating along with being on time and getting the job done! Definitely recommend!",
      "date": "2022-01-05",
      "stars": 5
    },
    {
      "reviewer_name": "Jason Stricklin",
      "text": null,
      "date": "2021-10-23",
      "stars": 5
    },
    {
      "reviewer_name": "Matthew Tribble",
      "text": "They was very respectful. They got the job done very fast and it looked amazing. This is the only people I will call from now on.",
      "date": "2021-08-16",
      "stars": 5
    }
  ],
  "Mullins Plumbing (ChIJNfLI22Ap1IcREiWBHhglr44)": [
    {
      "reviewer_name": "Anonymous",
      "text": "",
      "date": "Unknown date",
      "stars": 0
    }
  ],
  "DrainPro Professional Services (ChIJ86k1UoPO1YcRfh3x4zkV1eo)": [
    {
      "reviewer_name": "Betsy Yancey",
      "text": "very professional helped with all that was stopped up! ! Thanks I will call you for all my plumbing needs!",
      "date": "2025-02-11",
      "stars": 5
    },
    {
      "reviewer_name": "Brittany Edwards",
      "text": "Very professional worked hard cleaned up after themselves. Did a very good job",
      "date": "2025-02-11",
      "stars": 5
    },
    {
      "reviewer_name": "Jessica Guth",
      "text": "Mr Edward's came out to fix my washer drain. He was very fast and professional!  Very reasonable rates!   Both him and the guy helping him were very friendly!  I'd definitely recommend his business to anyone!",
      "date": "2025-01-28",
      "stars": 5
    },
    {
      "reviewer_name": "Dallis Chuter",
      "text": "He came out on Sunday night in 20 degree weather and fixed my problem didn't take long to do the work",
      "date": "2025-01-20",
      "stars": 5
    },
    {
      "reviewer_name": "Jacob Reaves",
      "text": "Great job at a fair price!  Good communication about what was done.   Helped manage my tenants expectation in the future. Thanks!",
      "date": "2025-01-14",
      "stars": 5
    },
    {
      "reviewer_name": "Yvonne Cliatt",
      "text": "Brandon and the guys at Drain Pro are the best. They show up when you need them and do whatever is necessary to help you! They are awesome! Yvonne from CubeSmart in Marion on I-55 Access Rd 😉👍",
      "date": "2025-01-13",
      "stars": 5
    },
    {
      "reviewer_name": "farrukh abbasi",
      "text": "He fix my water heater while it was in a car trunk. He did a good job while its snow plus Saturday. Thank you Sir really appreciated.",
      "date": "2025-01-11",
      "stars": 5
    },
    {
      "reviewer_name": "chris secrease",
      "text": "Very helpful & knowledge with trouble shooting fixing my hot water heater.",
      "date": "2025-01-10",
      "stars": 5
    },
    {
      "reviewer_name": "Bobby Robert Brown",
      "text": "Drainpro Professional are the go people to go  if you want your plumbing done the right way kitchen problem bath or busted pipes\nproblem done professional name speaks for itself recommend anyone having these problems amen to\nthe pro's Bobby",
      "date": "2025-01-04",
      "stars": 5
    },
    {
      "reviewer_name": "David Teague",
      "text": "Very helpful and knowledgeable. Would recommend to anyone needing plumbing services.",
      "date": "2025-01-03",
      "stars": 5
    },
    {
      "reviewer_name": "Seth Moon",
      "text": "DrainPro Professional Services are very professional, quick, and highly knowledgeable about their profession. We would highly recommend them, as they are always honest and fair in their prices and work.",
      "date": "2025-01-03",
      "stars": 5
    },
    {
      "reviewer_name": "Melanie New",
      "text": "I am above and beyond impressed with this company’s professional service! Brandon is obviously an expert in his field displaying excellent customer service skills, work ethic and trustworthy values!",
      "date": "2025-01-01",
      "stars": 5
    },
    {
      "reviewer_name": "Franco Cabada",
      "text": "I can’t express how great of a service he provided, I had a slab/foundation leak, where the pipe was busted and leaked water onto our floor, he had all the tools for the job. Told me he would be here on a Tuesday, and got the job done the same day. Very helpful and true! Very reasonable prices!",
      "date": "2025-01-01",
      "stars": 5
    },
    {
      "reviewer_name": "Wally Lee",
      "text": "Use this service today for an issue with water pressure in bath tub. They were able to fix my issue plus correct 6 other issues the remodel crew messed up. If you want the job done right give them a call. They are the best.",
      "date": "2024-12-28",
      "stars": 5
    },
    {
      "reviewer_name": "Adela Herrera",
      "text": null,
      "date": "2024-12-28",
      "stars": 5
    },
    {
      "reviewer_name": "Doris Penter",
      "text": "I had a fitting busted due to years of being installed from building the house 28 years ago  I called today and it was fixed within the hour of them coming today.  Great job they did, I gave a 5 star review. I am so proud I called them. I will call again if I need a plumber. Thanks Doris",
      "date": "2024-12-26",
      "stars": 5
    },
    {
      "reviewer_name": "Tracy Meadows",
      "text": "Great job! Professional, trustworthy, quality work. You cant go wrong with Drainpro.\n\nI'm adding this to this review. I developed  a problem and true to his word, Brandon came out AFTER DARK, in 39 degrees, and fixed the problem. Brandon is a man of his word, and he can be relied on when you need help. Thanks, Brandon!",
      "date": "2024-12-26",
      "stars": 5
    },
    {
      "reviewer_name": "Felicia Ragland",
      "text": "Had a leak and he came over in 40 degree weather and in the rain and got it fixed within an hour! Great service would highly recommend!",
      "date": "2024-12-17",
      "stars": 5
    },
    {
      "reviewer_name": "Connor 72",
      "text": null,
      "date": "2024-12-16",
      "stars": 5
    },
    {
      "reviewer_name": "Jonathan Williams",
      "text": "The best around got to me in in a very good timely manner had me fixed in minutes. Very good service and very kind, generous, helping people 10/10 recommend them best prices around as well!",
      "date": "2024-12-12",
      "stars": 5
    },
    {
      "reviewer_name": "Blue_Nexus_",
      "text": "Great service, quick and easy",
      "date": "2024-12-11",
      "stars": 5
    },
    {
      "reviewer_name": "Winston Beesinger",
      "text": "Great experience. Would call again",
      "date": "2024-12-10",
      "stars": 5
    },
    {
      "reviewer_name": "tom perrine",
      "text": "Came out and explained what the problem was and saved a lot of money.",
      "date": "2024-11-27",
      "stars": 5
    },
    {
      "reviewer_name": "Keiron",
      "text": "Very professional took the time to explain the problem and was very good on his prices would highly recommend 10/10 service",
      "date": "2024-11-27",
      "stars": 5
    },
    {
      "reviewer_name": "Alan Price",
      "text": "I had a bad backup at my home. I called Brandon at 8pm, he was nothing but helpful. He told me what to try, who to call at the city to try and get my lines flushed. Great guy should be your first call!!!",
      "date": "2024-11-23",
      "stars": 5
    },
    {
      "reviewer_name": "Jacob Breytspraak",
      "text": "DrainPro plumbing took care of us without a doubt! They were professional and very reasonable! They will be my go to for all other plumbing needs! I give these guys a 5 star without a doubt!",
      "date": "2024-09-20",
      "stars": 5
    },
    {
      "reviewer_name": "Felicia Ragland",
      "text": "They did amazing! Went above and beyond with their work! Great prices and would highly recommend them for any of your plumbing needs. Always informed me of what was going on also",
      "date": "2024-09-12",
      "stars": 5
    },
    {
      "reviewer_name": "Mike Ring",
      "text": "Me and my cousin had a stopped up kitchen sink for almost a week. After calling and calling several different services I stumbled upon DrainPro. In short, it's the best stumble I've ever made. Brandon knows his stuff and is proficient in every sense of the word. Will definitely be calling him for any future plumbing problems. More than reasonable pricing. Did a simple job that Nuckles & Son couldn't. Or rather wouldn't and still charged us. Thank you so much Brandon",
      "date": "2024-07-23",
      "stars": 5
    },
    {
      "reviewer_name": "Linda Jones",
      "text": "Brandon fixed our miss up right away. Just 1 phone call and he came to fix our shower. Thank you so much.",
      "date": "2024-06-30",
      "stars": 5
    },
    {
      "reviewer_name": "michael witt",
      "text": "showed up same day. Was very professional  and solved my problem. Will def use them for all plumbing needs in the future.",
      "date": "2024-06-19",
      "stars": 5
    },
    {
      "reviewer_name": "Ainsley Wright",
      "text": "We were first time customers and called Brandon around 11:30 am. He had someone at our house at 12:50 pm the same day! Talk about fast! The workers were so nice and helpful, showed me everything they did and had us up and running within ten minutes! We will absolutely being using Brandon's services for all of our plumbing needs!",
      "date": "2024-06-14",
      "stars": 5
    },
    {
      "reviewer_name": "Clay Wright",
      "text": "DrainPro came and helped us with our problems and had them fixed in no time. Great service all around.",
      "date": "2024-06-14",
      "stars": 5
    },
    {
      "reviewer_name": "Brian Daniel",
      "text": "First time customer. They were top notch professionals with excellent customer service. Actually listened to my issue and had it resoved without hesitation.  I now have a plumber for as long as DrainPro is plumbing and so should you!",
      "date": "2024-06-06",
      "stars": 5
    },
    {
      "reviewer_name": "Venus Whitehurst",
      "text": "I called him at 2am and he picked up. Came the next afternoon. Now what had to be done he couldn't fix because it ran off my property but he walked me through the entire process and helped me find who I needed to to get it fix. He is the only plumber we will ever use again!\n\n05/17/2024\nHad to call again for a new problem. This man and his crew came out again in a timely manner. Didn't charge much at all. Very friendly and respectful. Walked me through the process and talked to the water company. They are the only plumber that will come out to Lake City Arkansas. 10/10. Will call every time I have a plumbing problem!",
      "date": "2024-05-17",
      "stars": 5
    },
    {
      "reviewer_name": "Dillon H",
      "text": "Have used them twice and each time they were out here within 30 minutes. They were professional and courteous. If you need a plumber you should call these guys.",
      "date": "2024-04-11",
      "stars": 5
    },
    {
      "reviewer_name": "Donnie Battles",
      "text": "Brandon and his workers are top tier when it comes to service and customer care. They are nothing but professionals. I'm a new homeowner and I will not call anyone else.",
      "date": "2024-04-05",
      "stars": 5
    },
    {
      "reviewer_name": "Edward Yarbrough",
      "text": "I would highly recommend Brandon and Drain Pro. They go above and beyond on a regular basis and provide superior work and superior customer service. If you need a plumber, look no further. He has always done great work for me.",
      "date": "2024-03-25",
      "stars": 5
    },
    {
      "reviewer_name": "Amber Fahr",
      "text": "They stayed until the job was done and pricing was reasonable! Quality work..great company and the owner is very friendly and courteous",
      "date": "2024-03-22",
      "stars": 5
    },
    {
      "reviewer_name": "C&B Legacy LLC",
      "text": "We have used Brandon numerous times across several properties. He goes above and beyond and makes sure that the job is done right every single time.\nAs long as we can help it, we will never use any other plumber.",
      "date": "2024-03-15",
      "stars": 5
    },
    {
      "reviewer_name": "ryan richardson",
      "text": "Called on Saturday morning and arrived 45 minutes later.  Awesome job!",
      "date": "2024-02-24",
      "stars": 5
    }
  ],
  "Pennington's Creatives (ChIJv3qsZM8MO2gRMMNRgRfAvls)": [
    {
      "reviewer_name": "Jordain Coffey",
      "text": null,
      "date": "2023-05-13",
      "stars": 5
    },
    {
      "reviewer_name": "Bible reading, Songs, and More",
      "text": null,
      "date": "2023-05-12",
      "stars": 5
    },
    {
      "reviewer_name": "Tori Pestel",
      "text": "Great work Guaranteed, with great prices. Excellent customer service and satisfaction! Wide range of skills from electrical to plumbing, remodeling to repairs and mechanic skills!",
      "date": "2023-05-12",
      "stars": 5
    },
    {
      "reviewer_name": "Natashia Hilentzaris",
      "text": "When I say these folks can DO ANYTHING, I MEAN IT!!\nFrom the plumbing work, to the emergency electrical work I needed for my business, PENNINGTONS WAS THERE FOR ME!\nDon’t take my word for it, try it yourself, YOU WONT BE DISAPPOINTED!\nThank you PENNINGTONS CREATIVES!!",
      "date": "2023-05-12",
      "stars": 5
    }
  ],
  "B&B Repair Appliance parts, sales and service (ChIJIawW7VXH1ocR1UrE4k0sKJI)": [
    {
      "reviewer_name": "Dara Askew",
      "text": "Our experience with this company was great!   We will most definitely use them for future needs.",
      "date": "2024-12-31",
      "stars": 5
    },
    {
      "reviewer_name": "Nicole Moody",
      "text": "Billy is the first person I call when any of my appliances mess up!",
      "date": "2024-12-06",
      "stars": 5
    },
    {
      "reviewer_name": "homesteadingoats",
      "text": "Went above and beyond to help fix my oven. If I could give 6 stars,I would.  Top notch service!",
      "date": "2024-11-06",
      "stars": 5
    },
    {
      "reviewer_name": "Janna Guthrey",
      "text": "Billy is dependable and knowledgeable. He has made three trips to our home and made the needed repairs in a timely and affordable way. I highly recommend him!",
      "date": "2024-11-06",
      "stars": 5
    },
    {
      "reviewer_name": "Charlotte Graham",
      "text": "They were easy to schedule with, communicative, reasonable in price, & even came back the same day when they didn’t have a part with them.",
      "date": "2024-11-05",
      "stars": 5
    },
    {
      "reviewer_name": "Pamela L. Haynes",
      "text": null,
      "date": "2024-05-09",
      "stars": 1
    },
    {
      "reviewer_name": "Marla Helms",
      "text": "I was looking for someone to fix my mother's refrigerator. He was awesome, was there in a timely matter, gave a quote and stuck to it. And the refrigerator is working again!",
      "date": "2023-08-31",
      "stars": 5
    },
    {
      "reviewer_name": "Sabra Jackson",
      "text": "Worked hard to complete project. Let me know about each phase of job, to be done.",
      "date": "2021-03-13",
      "stars": 5
    },
    {
      "reviewer_name": "Larry Moore",
      "text": "Excellent",
      "date": "2021-01-04",
      "stars": 5
    },
    {
      "reviewer_name": "Virginia Hill",
      "text": null,
      "date": "2020-01-18",
      "stars": 5
    },
    {
      "reviewer_name": "Joann Hinkle",
      "text": null,
      "date": "2019-11-28",
      "stars": 5
    },
    {
      "reviewer_name": "Cody Mcgee",
      "text": "They are the best",
      "date": "2019-05-27",
      "stars": 5
    },
    {
      "reviewer_name": "summer harston",
      "text": "Mr Bill showed up early and saved me alot of money by repairing my side refrigerator with bottom freezer. He has an incredible amount of experience, not to mention patience with my animals. His bill was more than fair- especially since he spent so much time on my refrig. Labor cost was very low.",
      "date": "2018-05-09",
      "stars": 5
    },
    {
      "reviewer_name": "Bethany James",
      "text": null,
      "date": "2018-04-28",
      "stars": 1
    }
  ],
  "Arkansas Jetting & Plumbing Services, Inc. (ChIJg4gvel8-0YcRp-QbpDeFWWU)": [
    {
      "reviewer_name": "Robbi Reddell",
      "text": null,
      "date": "2024-06-28",
      "stars": 1
    },
    {
      "reviewer_name": "Joette Iris",
      "text": "Immediate response and same day service.  They took the time to explain everything before it was done.  Quick and efficient.  Highly recommended!!",
      "date": "2021-10-13",
      "stars": 5
    },
    {
      "reviewer_name": "John Manley",
      "text": "These people are awesome!!! Very knowledgeable and very professional and very reasonable...Call them first before you call anyone..",
      "date": "2020-09-26",
      "stars": 5
    }
  ],
  "Etowah Plumbing (ChIJPX-L90lBiogR3QgpY7cHZpo)": [
    {
      "reviewer_name": "susiew0905",
      "text": "Returned my call within 1 hour and came out the same day, fixed the leak under our kitchen sink and was completely done and out the door in less than 30 min.  Will definitely use them for any plumbing needs!!  Thanks again!!",
      "date": "2021-01-18",
      "stars": 5
    },
    {
      "reviewer_name": "Kyler Adams",
      "text": "I’ve used these guys several times now to fix some leaking pipes under my house. Very responsive when I call. Showed up within a hour to fix the leak. Very reasonably priced, does not over charge like some plumbers.",
      "date": "2020-11-12",
      "stars": 5
    },
    {
      "reviewer_name": "Renee Hilderbrand",
      "text": "I would recommend them for service",
      "date": "2020-06-06",
      "stars": 5
    },
    {
      "reviewer_name": "Chance Bedwell",
      "text": "Eric came in to our new build and did a wonderful job. We will use them again!",
      "date": "2020-01-15",
      "stars": 5
    },
    {
      "reviewer_name": "Eric Mcelroy",
      "text": null,
      "date": "2019-04-30",
      "stars": 5
    },
    {
      "reviewer_name": "Mallorie Belyeu",
      "text": "I contacted Etowah Plumbing about a plumbing issue I needed to be fixed ASAP. I was told they would be there that day unless the weather was bad. If the weather was bad, they’d be there first thing the next morning, and we would just have to play it by ear and they would call me. I did not continue to call around to find someone else because they said they would be there. Well that day, they never called or showed up. It did rain so I figured that was why. I called first thing the next morning. There was no answer and the voicemail was full. I sent a text asking if they were coming and immediately got a response saying that they broke the cable on the machine yesterday. No one contacted me to let me know. They knew I was on a time frame and I trusted them to be there. I understand that things happen, but they should have called. I could have had someone else lined up to get what I needed done.",
      "date": "2019-03-26",
      "stars": 1
    },
    {
      "reviewer_name": "Thomas Gossett",
      "text": null,
      "date": "2018-09-17",
      "stars": 4
    },
    {
      "reviewer_name": "Cmcelroy683@gmail.com harley",
      "text": null,
      "date": "2018-03-23",
      "stars": 5
    }
  ],
  "Holloway Heating & Air LLC Plumbing & Electrical (ChIJYRUpb5Ko1YcRdMcRIX--CDs)": [
    {
      "reviewer_name": "Jill blackmon",
      "text": "They do excellent work!!",
      "date": "2020-09-27",
      "stars": 5
    }
  ],
  "Milverton Plumbing (ChIJq99fieBW0YcRMO9dP-NJRkA)": [
    {
      "reviewer_name": "Larry Mooring",
      "text": "I tried several times to call them and left messages each time but never got a response.\n\nUPDATE 11/22/22: Was contacted today and a timeframe was established for the work to be done.  The owner was out of the country and therefore not available.",
      "date": "2022-11-23",
      "stars": 5
    }
  ],
  "Workhorse Plumbing (ChIJ3z7lV_BW0YcRonmFlkE1SCI)": [
    {
      "reviewer_name": "Georgia Jump",
      "text": "No answer when called twice and my son tried also",
      "date": "2025-02-14",
      "stars": 1
    },
    {
      "reviewer_name": "Teri Jones",
      "text": "Very respectful and friendly and good work. Will call again and would recommend to friends.",
      "date": "2021-03-25",
      "stars": 4
    },
    {
      "reviewer_name": "Sparks",
      "text": null,
      "date": "2020-10-20",
      "stars": 5
    }
  ],
  "White River Sewer & Drain (ChIJh2MXfjaVZqwR8p8ljb7FEh4)": [
    {
      "reviewer_name": "Sarah Thomas",
      "text": null,
      "date": "2024-10-15",
      "stars": 5
    },
    {
      "reviewer_name": "Robert Haddad",
      "text": "We found this gentleman thru an emergency on a Saturday, with a google search. He came out and fixed our immediate problem, but discovered our septic tank was full of tree roots. Very professional and a pleasure to deal with. Was very transparent with what needed to be done, did promptly and very reasonable in pricing.  Most if not all other companies would just tell us to replace our tank, but he suggested just taking the top off and removing the roots.  Which is what he did, and repaired a corner of the tank that the roots broke off. Saved us thousands. I cannot give any higher recommendation of a person or a company.  If you need work within his scope, you would regret not using them. I will be using them for any sewar or drain issue that occurs.",
      "date": "2024-09-18",
      "stars": 5
    },
    {
      "reviewer_name": "Ty Tistle",
      "text": "Doug Smith is the owner of White River Sewer & Drain. He was a pleasure to work with and he will continue to have our support! He is very intelligent & knowledgeable in his line of work. His communication skills are outstanding. He is very quick to fix things in a timely manner. Lastly he is a very honest, hard working individual that we are all looking for today! Give Doug Smith a call & you won’t regret working with him, we didn’t! If I have any more issues down the road, he will be my first call! We appreciate you White River Sewer & Drain.",
      "date": "2024-09-06",
      "stars": 5
    }
  ],
  "Harris Plumbing (ChIJtwAIRs9Z1IcRXNsh3UrjUO8)": [
    {
      "reviewer_name": "Karen Glass",
      "text": "Impressive!! Been calling a plumber for two days and still haven't seen them i called harris plumbing and received a call back within the hour he came out same day! (As he said he would) he took his time to talk with me and made phone calls and explored all options seemed very knowledgable and reasonable so if you need a plumber don't waste your time and days!!! JUST CALL HIM!!!",
      "date": "2024-10-31",
      "stars": 5
    },
    {
      "reviewer_name": "Collin Fountain",
      "text": "Met with Ricky and was told he would get it done in two weeks. It has now been 3 months and he won't answer calls or texts",
      "date": "2023-11-13",
      "stars": 1
    },
    {
      "reviewer_name": "Harold Souheaver",
      "text": null,
      "date": "2023-06-17",
      "stars": 1
    },
    {
      "reviewer_name": "Jennifer Urtz",
      "text": null,
      "date": "2023-02-14",
      "stars": 5
    },
    {
      "reviewer_name": "Lavonya Givance",
      "text": "We hired Harris Plumbing to plumb a detached building. He started the job and asked for a payment. We paid what he asked. He was supposed to return to finish the job after the other buildout was completed. However, he has never returned to finish the job. After many calls to him and him giving dates which he says he is coming to do the work, the job is still unfinished and he doesn't appear to be coming back to finish the work. Therefore, we are left to find another plumber to go behind him and finish the job.\nWe won't use him again and wouldn't recommend him to others.",
      "date": "2023-02-03",
      "stars": 1
    },
    {
      "reviewer_name": "Albert McGill",
      "text": "Fast friendly service",
      "date": "2022-11-01",
      "stars": 5
    },
    {
      "reviewer_name": "John Myrick",
      "text": "It's had as the devil to get a plumber in Wynne, period! But Ricky at least calls back, is forthright and honest, and does great work!",
      "date": "2022-06-15",
      "stars": 5
    },
    {
      "reviewer_name": "Phyllis Head",
      "text": "I am very happy with their service. I called them on Tuesday because I had no hot water and he came Wednesday morning. Installed a new water tank in no time at all. Very nice and professional. I will absolutely call them for any other issues. He even answered questions I had about water filtration and quoted prices if I decided to have it installed.  😊",
      "date": "2022-06-01",
      "stars": 5
    },
    {
      "reviewer_name": "Teresa Frost",
      "text": "Very professional and timely. Took care of my problem the same day I called. Very courteous. I would recommend Harris Plumbing for all your needs.",
      "date": "2021-05-11",
      "stars": 5
    },
    {
      "reviewer_name": "Timothy Wesson",
      "text": null,
      "date": "2021-04-25",
      "stars": 1
    },
    {
      "reviewer_name": "Alexis Boyd",
      "text": "So thankful that Harris Plumbing resolved a terrible leak.  In fact, they were able to come out same day!! Thanks again!!",
      "date": "2020-05-04",
      "stars": 5
    },
    {
      "reviewer_name": "Asia Boykin",
      "text": "I called him for issue and he was there within 30 minutes! Thanks for your service!",
      "date": "2020-02-12",
      "stars": 5
    },
    {
      "reviewer_name": "Tanner Huffman",
      "text": "This guy is top notch! Not only does he do fantastic work, he is, by far, the most dependable and can beat the pricing of any other plumbers in the area. I’ve had to call him twice within the last week for jobs that needed immediate attention, both during weekend hours. He was here within 15 minutes each time. Ricky is definitely the guy to call if you live in Cross County!",
      "date": "2020-01-15",
      "stars": 5
    },
    {
      "reviewer_name": "T Smith",
      "text": "This plumber was called and he told me that he would start a job for me in the next 2 days, he never showed up.  I called him and he replied that he wasn't going to be able to do the work.  There are people without gas in their homes.  He was just inconsiderate and very poor service.",
      "date": "2019-11-01",
      "stars": 1
    },
    {
      "reviewer_name": "Holly Wilcox",
      "text": "Ricky was called Thursday night, came out and looked Friday, and showed up bright and early Monday morning to fix our water leak, shower leak, and sink! Within 5 hours, everything was back to working like new! They replaced our sink and vanity, replaced our shower head, and ran new hot water pipe to bathroom, laundry room, and kitchen! Ricky and Jacob did an awesome job!! And they are both such nice, friendly, HONEST men!! I highly recommend them for any plumbing issue you have!! They're fast, affordable, and good at what they do!!",
      "date": "2019-08-26",
      "stars": 5
    },
    {
      "reviewer_name": "Retha Stephens",
      "text": "Very very kind and courteous. Respected my home. Fixed my problem the cheapest and the best way. Recommend him",
      "date": "2019-08-06",
      "stars": 5
    },
    {
      "reviewer_name": "deana forrester",
      "text": null,
      "date": "2019-05-16",
      "stars": 5
    },
    {
      "reviewer_name": "Chairty Sackville",
      "text": "Great service and affordable prices! Will definitely use again.",
      "date": "2019-05-16",
      "stars": 5
    }
  ],
  "Larry's Plumbing and Mitchell’s Construction (ChIJCTK1eVof1ocR4bXheNQUGlQ)": [
    {
      "reviewer_name": "Garry Thorp",
      "text": "Awesome response and awesome job, thank you Larry and your Crew for fixing my underground swimming pool that I was unaware of until I got my water bill lol !! Don’t hesitate to call these guys I will for sure again!!",
      "date": "2024-07-28",
      "stars": 5
    },
    {
      "reviewer_name": "Keith McCoy",
      "text": "These guys really know what they’re doing won’t stop until the job is done even if it starts getting dark good prices good people do local",
      "date": "2024-05-30",
      "stars": 5
    },
    {
      "reviewer_name": "Ruth",
      "text": "Simply the best with their work!! Professional, friendly. Could not be more pleased with the job they did for me. I would recommend highly, and I already have recommended to my family. They will do you right. (And I’m not related to them and never met them before).",
      "date": "2024-05-03",
      "stars": 5
    },
    {
      "reviewer_name": "Larry Lyons",
      "text": "Amazing service. Took care of the problem even though it took several methods!",
      "date": "2023-12-21",
      "stars": 5
    },
    {
      "reviewer_name": "Larry Tidwell",
      "text": null,
      "date": "2023-10-27",
      "stars": 5
    },
    {
      "reviewer_name": "Kane Vaughn",
      "text": "We had a major leak happen at the house with old piping, they came out that Monday and had everything completed for us in a timely manner. They also helped us with a tankless water heater install. Really nice guys who let us know what was happening throughout the entire process.",
      "date": "2023-10-26",
      "stars": 5
    },
    {
      "reviewer_name": "Michael GANUS",
      "text": "Called them and they came out when they said the would. The drain was plugged up bad. He didn’t give up and finally got it unstopped. Highly recommend this company.",
      "date": "2023-07-18",
      "stars": 5
    },
    {
      "reviewer_name": "U.S. Security Solutions",
      "text": "We came home from out of town after the freeze in Jan/Feb 2023 and found that we had a water leak.  I called a few plumbers, all of whom were busy for 3 weeks out and said they would put our name on a list.  I found Kevin of Larry's plumbing and he had 3 people at my home within 1 day.  They worked and worked trying to find the leak to no avail.  He quoted a price to replace my pipes, which were in dire need because they were so old.  Within 1.5 wks we had brand new pipes at the quoted price.  His people are prompt, knowledgeable, courteous and accommodating.  I will never use another plumber and recommend Larry's to everyone.  I NEVER received a call back after placing my name on the list of several other plumbers.",
      "date": "2023-04-04",
      "stars": 5
    },
    {
      "reviewer_name": "Jeff Beck",
      "text": "Larry’s Plumbing/Mitchell Construction is AMAZING!! Kevin and his crew are top notch, great people. Hard workers, professional, courteous, and very knowledgeable, among many other great adjectives too many to name. Kevin and Co. even came in behind another plumber’s botched and OVERPRICED work, and had the problem fixed in less than an hour and half the cost!\nThey also replaced the total old clay sewer drainpipe and main waterline (even with many obstacles) and worked until it was done. They are the best!! I wish I could give them more than 5 stars. Oh, I can!\n⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️\nThanks again guys!! You are the best! We now have not only new plumbers but new friends to match!! Salute!!",
      "date": "2023-03-01",
      "stars": 5
    },
    {
      "reviewer_name": "clara johnson",
      "text": "In July 2022 Larry's plumbing come and fixed a gas leak, installed my propane water heater and fixed a water leak. The last part of December our pipes froze and busted, it took a while; however, he always kept me updated on where we was on the list. They came out and fixed it. I do highly recommend Larry's plumbing.",
      "date": "2023-01-05",
      "stars": 5
    },
    {
      "reviewer_name": "Christine Campbell",
      "text": "Contacted Kevin Mitchell with Larrys Plumbing and he come right out and give me an estimate on the job I needed done. Kevin and his crew showed up when they said they were going to and worked until they got the job done. I needed them to redo the drains in my entry house. They completed what they could of my job at the time and told me to call them when I was ready to put the bath tub in. I called them yesterday about attaching the drain to the tub and they showed up today and completed that job. I am extremely pleased with the job they have done for me and will continue to call them when they are needed! Thank you for the great and fast service Kevin!",
      "date": "2023-01-03",
      "stars": 5
    },
    {
      "reviewer_name": "em ton",
      "text": "Have broken pipes spoke with Larry and he stated he would come the next day. He did not show up or even contact me that he would not be coming. Unacceptable business practice.",
      "date": "2022-12-31",
      "stars": 1
    },
    {
      "reviewer_name": "Timothy Hicks",
      "text": null,
      "date": "2022-12-23",
      "stars": 5
    },
    {
      "reviewer_name": "Anthony Jennings",
      "text": null,
      "date": "2022-12-04",
      "stars": 5
    },
    {
      "reviewer_name": "Judi Peridore",
      "text": null,
      "date": "2022-09-22",
      "stars": 5
    },
    {
      "reviewer_name": "Eric Finley",
      "text": "Get it done",
      "date": "2022-09-16",
      "stars": 5
    },
    {
      "reviewer_name": "william clay",
      "text": "I called Larry’s and Kevin came right out. They found the problem, gave me a quote on replacing all the water lines in my home. I highly recommend these guys. They are up front , honest and dependable . They will be replacing all my lines. Thanks guys!!",
      "date": "2022-06-04",
      "stars": 5
    },
    {
      "reviewer_name": "Brian Grubb",
      "text": null,
      "date": "2021-12-18",
      "stars": 5
    },
    {
      "reviewer_name": "ahnisti long",
      "text": "Fair fast working and great customer service",
      "date": "2021-08-03",
      "stars": 5
    }
  ],
  "Paragould Home Repair Service (ChIJB-kFGerFNSsRyAHhrpnPYxw)": [
    {
      "reviewer_name": "Anonymous",
      "text": "",
      "date": "Unknown date",
      "stars": 0
    }
  ],
  "Mike The Plumber (ChIJ82Ep3z8nq6YRbhwClcPYwMA)": [
    {
      "reviewer_name": "Brian McKinny",
      "text": "I had two water heaters in the alcove under my staircase downstairs that are original to the house that finally gave up the ghost -  after 43 years, they blew up! Talk about going into panic mode when you see water spewing out from under the stairs! Yikes!😱\n\nSo I called Mike The Plumber for rescue! Mike and his trusty sidekick Hunter did a bang-up job on my water emergency 🚨 and they had me back up and running with two brand new water heaters and all the electrical and plumbing fittings replaced in what must have been record time - just under 4 hours from start to finish!\n\nMike and Hunter’s work is top notch, in both conducting themselves as complete gentlemen, very respectful of myself and my home, and my two overly-friendly dogs, combined with the excellent work they did in replacing two very old, heavy, and rotted out water heaters in an extremely confined space under the stairs.\n\nI have a couple of other plumbing projects that need doing, and I won’t hesitate to give Mike The Plumber a call and give the work to them again! I cannot stress enough how professional and friendly Mike and Hunter are, and I look forward to having them deal with my other plumbing woes/needs in the very near future - so you should have no hesitation in hiring these gentlemen. You won’t regret it, I can assure you of that!\n\nWe had a real plumbing emergency and they took the stress right out of the equation! Thank you, Mike and Hunter for doing a truly fantastic job!",
      "date": "2024-11-08",
      "stars": 5
    },
    {
      "reviewer_name": "Michelle Winslow",
      "text": "Prompt return of my call! As a disabled Veteran I appreciate that.",
      "date": "2024-11-08",
      "stars": 5
    },
    {
      "reviewer_name": "Deborah Tilligkeit",
      "text": "After chasing a swimming pool pipe leak in our return pipes, we called on Mike to see if he had the detection equipment needed.  He was upfront with us on the initial visit, letting us know he had not diagnosed too many pools but was willing to work with us, and we came up with a plan.  Second visit out he brought all his equipment and his assistant.  We found the broken pipe within the first hour.  The detecting method was used to check existing lines, and all came out well.  Mike saved us countless hours of jack hammering concrete searching for the unknown.  Mike was punctual, and his communication was excellent.",
      "date": "2024-10-22",
      "stars": 5
    },
    {
      "reviewer_name": "Michael Bianculli",
      "text": "Called with a problem and they were quick to come out. Hunter was very knowledgeable and took the time to explain what he was doing. We highly recommend their service and will keep their number for future plumbing needs.",
      "date": "2024-09-18",
      "stars": 5
    },
    {
      "reviewer_name": "Shane Stolz",
      "text": "Hunter was efficient and fast. Awesome work !!",
      "date": "2024-08-05",
      "stars": 5
    },
    {
      "reviewer_name": "Susan Stetler",
      "text": "Mike & Hunter put a new hot water heater in for me. I called Mike late in the day and he was at my house first thing the next morning. I live in an older home and the water heater was in a very tight space and and whoever had installed the previous one did not install it up to code. Mike said it was a very dangerous fire hazard. Hunter was excellent climbing up in small attic crawl space and down under house explaining everything as he was going along. So very pleased. I would definitely recommend  them for your job. They're the BEST! Thanks again Mike and Hunter!",
      "date": "2024-04-07",
      "stars": 5
    },
    {
      "reviewer_name": "Charleen Sanford",
      "text": "Knowledgeable and friendly service!",
      "date": "2024-04-01",
      "stars": 5
    },
    {
      "reviewer_name": "Rory Gilliland",
      "text": "Great communication tech took his time and throughly test shower to find out why it was leaking. He didn't give up when it wasn't easy and diagnosed it as a simple fix. Fast service fair pricing and great communication within the company to help the customer. I will use them in the future for some upcoming projects.",
      "date": "2024-03-22",
      "stars": 4
    },
    {
      "reviewer_name": "Donna Kurz",
      "text": "Always very helpful and available.",
      "date": "2024-01-21",
      "stars": 5
    },
    {
      "reviewer_name": "Kaitlyn McMasters",
      "text": "Mike has done plumbing work at our house twice now and has done an amazing job. First, we had a whole house backup due to roots growing into our old pipes. When we called Mike, he got back to us really quickly and was able to dig up and replace pipes and get it all fixed within just a few days which was amazing! Also worth mentioning that his prices are very fair. Not overpriced at all. Then, recently, we had a clog in the shower drain that was pretty bad. He answered my call and the next day was there to remove it! I would 100% recommend Mike the Plumber to any and everyone.",
      "date": "2023-12-01",
      "stars": 5
    }
  ],
  "JP's Plumbing LLC (ChIJXWV4VEXv0ocR_8n1NKHfJFU)": [
    {
      "reviewer_name": "Chris Kamm",
      "text": "Jason came out on a Saturday afternoon fixed our immediate problem and gave us estimates for future work. He was prompt, professional, courteous, and didn't try to chop our heads off with the bill. I will recommend him to everyone I know that needs to call a good honest and affordable plumber.",
      "date": "2024-10-14",
      "stars": 5
    },
    {
      "reviewer_name": "98red300",
      "text": "Jason came out this morning and installed a pressure regulator and shutoff valve for me. From the time I called him I knew he was the right guy for the job. He is very friendly and has a lot of experience. Before he even started he wanted to make sure that’s what was causing my low pressure problem. So he did a couple of checks and verified it was a bad PRV. He did a fantastic job with the installation and his price was outstanding. If I need any other plumbing repairs he will be my go to plumber for now on. Thank you Jason.",
      "date": "2024-02-13",
      "stars": 5
    },
    {
      "reviewer_name": "Justin Kish",
      "text": "JP re-plumbed my entire 75 year old house and did quality work. I just had him back out to do move some appliance hook-ups and it turned out great as always",
      "date": "2024-02-12",
      "stars": 5
    },
    {
      "reviewer_name": "William Powell",
      "text": "Professional work at a fair price. Gave me a quote before starting the job, and it took a little longer than expected. His price was exactly as quoted.",
      "date": "2023-02-23",
      "stars": 5
    },
    {
      "reviewer_name": "Gabby Dudderar",
      "text": "I contacted JPs plumbing during their water heater sell, thé service was great! I’ll never use another plumber.",
      "date": "2023-01-27",
      "stars": 5
    },
    {
      "reviewer_name": "katie asman",
      "text": "He did a wonderful job. He was there on time. He his pricing is far and honest.",
      "date": "2022-10-22",
      "stars": 5
    },
    {
      "reviewer_name": "Chas Tamburo",
      "text": "Jason & Dawn worked me into their busy schedule to fix a leaky faucet. Jason went the extra mile to advise us on another small repair instead of billing us. Would recommend for anyone in Cabot/Lonoke County.",
      "date": "2021-08-13",
      "stars": 5
    },
    {
      "reviewer_name": "Chance Bronson",
      "text": null,
      "date": "2021-01-24",
      "stars": 5
    },
    {
      "reviewer_name": "Karen Massey",
      "text": "JP's Plumbing was on time and found our leak quickly and made the repair and his price is very reasonable.",
      "date": "2020-11-11",
      "stars": 5
    },
    {
      "reviewer_name": "James Wright",
      "text": "Left 2 messages for a quote on their website. Was told you will hear back within 48 hours via email.  I got nothing no call no email",
      "date": "2020-08-04",
      "stars": 1
    },
    {
      "reviewer_name": "Poolrific / Professional Pool Repairs",
      "text": "One of the best plumbing contractors  I have ever dealt with. Thanks again JP.",
      "date": "2020-07-23",
      "stars": 5
    },
    {
      "reviewer_name": "Buck Steel",
      "text": null,
      "date": "2020-07-21",
      "stars": 5
    },
    {
      "reviewer_name": "Deb Paris",
      "text": "Mr.  J.P himself came out to look at a musty smell in our bathroom. He went above and beyond to diagnose the problem,  explaining his train of thought the entire time and making sure we understood what was going on. We had an excellent experience and would gladly hire him again!",
      "date": "2020-04-16",
      "stars": 5
    },
    {
      "reviewer_name": "Travis Victory",
      "text": "Good guy. Good plumber. Knows what he is doing.",
      "date": "2020-01-28",
      "stars": 5
    },
    {
      "reviewer_name": "Chuck",
      "text": null,
      "date": "2020-01-15",
      "stars": 5
    }
  ],
  "Randy's HVAC, LLC (ChIJ4fjTltLrM4YRCloQzpx1NDg)": [
    {
      "reviewer_name": "Anonymous",
      "text": "",
      "date": "Unknown date",
      "stars": 0
    }
  ],
  "J Dodson Plumbing (ChIJv2MMMNlUzYcRMfKtJcqV2fI)": [
    {
      "reviewer_name": "Suresh Jayaraj",
      "text": "They are very professional and provide a GREAT service.",
      "date": "2024-12-13",
      "stars": 5
    },
    {
      "reviewer_name": "Anna Grace Cullum",
      "text": null,
      "date": "2024-07-01",
      "stars": 5
    },
    {
      "reviewer_name": "Patricia Ashworth",
      "text": "Thank you for replacing our Tankless Hot Water heater.  ( 0n May 13)  You where so quick to come help us.  We appreciate you so much. I will recommend you highly.\nPatricia Ashworth - 40 Wildwood Place Circle LR",
      "date": "2024-05-20",
      "stars": 5
    },
    {
      "reviewer_name": "Cecilia Dodd",
      "text": "He was amazing years back & continues to be awesome",
      "date": "2024-04-15",
      "stars": 5
    },
    {
      "reviewer_name": "Bonnie Mitchell",
      "text": "Jeremy is our go to. He always gets us taken care of quickly. Provides excellent quality at a fair price. If you need plumbing work, this is your guy.",
      "date": "2024-03-12",
      "stars": 5
    },
    {
      "reviewer_name": "John Clark",
      "text": "They installed me a new water heater at a good price. I called around it it was about as low as I could get. Professional job and took care of me.",
      "date": "2024-01-22",
      "stars": 5
    },
    {
      "reviewer_name": "Arkansas Leak-Detection",
      "text": "Jeremy is a great guy.  Great company.",
      "date": "2023-09-26",
      "stars": 5
    },
    {
      "reviewer_name": "Beverly Bivens McCall (Momma Bear)",
      "text": "Great guy. Excellent plumber.",
      "date": "2023-08-21",
      "stars": 5
    },
    {
      "reviewer_name": "Holly",
      "text": "Absolutely would recommend.",
      "date": "2023-07-24",
      "stars": 5
    },
    {
      "reviewer_name": "Ron Orintas",
      "text": "Jeremy always is professional. Does a good job and was here promptly.",
      "date": "2023-06-05",
      "stars": 5
    },
    {
      "reviewer_name": "Michael Williams",
      "text": "We had a leak in our gas line due to a neighbor’s construction. He had called the other company out and had them helping him find and fix the gas leak by the end of the next day. He was like a dog on a bone and wasn’t going to stop until it was fixed…he was there within a couple of hours to begin the work also!",
      "date": "2023-01-29",
      "stars": 5
    },
    {
      "reviewer_name": "Lisa Kroening",
      "text": "We have just recently moved to Benton and just like people all over Arkansas, our pipes froze, leaving us with no water and holiday guest on their way. Mr Dodson and one of his men came in a matter of minutes and started the unthawing process. I have no doubt he is still out there today ,Dec. 23, in frigid temps unthawing those in need. Thanks again and God Bless!!!  Will definitely use and recommend in the future.",
      "date": "2022-12-23",
      "stars": 5
    },
    {
      "reviewer_name": "Jason Seals",
      "text": "Jeremy is the most reliable and trustworthy plumber I've ever worked with. He is responsive and really cares about the customers he works with.\n\nOn a Saturday morning, after multiple issues with a hot water heater, he came to the rescue. Even having to locate and install a new unit, he was happy to help. He put his weekend plans on hold to come help me out and that will not be forgotten.\n\nJeremy is the epitome of customer first service and is willing to go above and beyond to ensure satisfaction. I will never call another plumber...",
      "date": "2022-07-23",
      "stars": 5
    },
    {
      "reviewer_name": "Cynthia anderson",
      "text": "Jeremy was able to come help us that very evening. He was professional, knowledgeable and did quality work! We will be using him for future plumbing needs. Highly recommend.",
      "date": "2021-11-23",
      "stars": 5
    },
    {
      "reviewer_name": "Nicolas Novielli",
      "text": null,
      "date": "2021-10-18",
      "stars": 5
    },
    {
      "reviewer_name": "Mary Smith",
      "text": "Mr. Dodson is very professional and was prompt when we called him. He discussed with us the problems he found and how he would fix them, including a price. We didn't go without water very long because he took care of us. I highly recommend this company. I have worked with other plumbers and none compare to his knowledge and professionalism.",
      "date": "2021-07-15",
      "stars": 5
    },
    {
      "reviewer_name": "brandon patterson",
      "text": "I've used Jeremy a few times and he's always been on time and professional. I would recommend him to anyone.",
      "date": "2021-06-03",
      "stars": 5
    },
    {
      "reviewer_name": "Jerome Fox",
      "text": null,
      "date": "2021-03-06",
      "stars": 5
    },
    {
      "reviewer_name": "Jason Reaves",
      "text": null,
      "date": "2021-02-26",
      "stars": 5
    },
    {
      "reviewer_name": "ray neal",
      "text": null,
      "date": "2020-11-23",
      "stars": 4
    },
    {
      "reviewer_name": "LeAnn Whiddon",
      "text": "Prompt, professional, knowledgeable and fair. I wouldn't dream of calling anyone else with my plumbing needs.",
      "date": "2020-09-30",
      "stars": 5
    },
    {
      "reviewer_name": "Mollie Moody",
      "text": "Very professional. Reasonable price.",
      "date": "2020-09-11",
      "stars": 5
    },
    {
      "reviewer_name": "Sheila Houser",
      "text": null,
      "date": "2020-07-02",
      "stars": 5
    },
    {
      "reviewer_name": "Lanette Chastain",
      "text": null,
      "date": "2020-06-18",
      "stars": 5
    },
    {
      "reviewer_name": "Kenneth Wartick",
      "text": "Jeremy answers his phone, gives accurate reasonable estimates, arrives when he says he will, does quick quality work, and genuinely seems like a nice guy.  I don’t often recommend people but I was very pleased with his work and highly recommend him.  He was highly recommended to me by our local plumbing supply company.",
      "date": "2020-03-24",
      "stars": 5
    },
    {
      "reviewer_name": "Kourtney Miller",
      "text": "We had a great experience with J Dodson Plumbing.  We will be using him again next time we have any plumping issues!!!",
      "date": "2020-03-03",
      "stars": 5
    },
    {
      "reviewer_name": "Joe Box",
      "text": null,
      "date": "2020-02-23",
      "stars": 5
    },
    {
      "reviewer_name": "Aaron Hunter",
      "text": "I was referred to Jeremy by word of mouth and have called on him several times because of the level of customer service.  One of the few service calls where I felt that I received more than my money's worth.  Always polite and punctual.  Quotes have been on par or better than competitors.  On more than one occasion, Jeremy has steered me away from unnecessary and costly repairs/replacements that I suggested.  His work ethic is excellent, and he is the first person I call for plumbing or suspected plumbing issues.",
      "date": "2020-01-16",
      "stars": 5
    },
    {
      "reviewer_name": "Ronald Orintas",
      "text": "Recommend this gentlemen for your home plumbing repairs. He's fair and honest. If he says he will be their at a certain time, count on it. Prices seem to be in line with others. Will use Jeremy for all our further needs here in Hot Springs Vlllage.",
      "date": "2019-12-14",
      "stars": 5
    },
    {
      "reviewer_name": "Terry Harrison",
      "text": "J Dodson came out immediately and fixed our hot water leak under the house. He really saved the day. He is very polite easy to talk to and knowledgeable for your plumbing needs. His pricing was way more than fair. I really expected it to cost more compared to other companies prices. We will get him to fix some other plumbing issues. I highly recommend calling J Dodson Plumbing.",
      "date": "2019-08-28",
      "stars": 5
    },
    {
      "reviewer_name": "Patricia Brown",
      "text": "I called them this morning and he came out this afternoon and within\n30 min fixed my water heated.  And he explained why the pilot light\nwent out.  I would recommend them to anyone who needs a plumber. He\nwas really a nice man.",
      "date": "2019-02-18",
      "stars": 5
    },
    {
      "reviewer_name": "SHARON WHITE",
      "text": "Mr Dodson came to our house today on our hot water heater.  He was so professional and had our problem fixed in 30 minutes. He was knowledgeable about it and explained everything as he went. He explained his charges before he came out and did not over charge us. We highly recommend him. Thanks you for coming on the weekend and not charging a after hour charge.  Excellent work.\n\nThe Browns",
      "date": "2019-02-18",
      "stars": 5
    },
    {
      "reviewer_name": "Lorrie Jilek",
      "text": "I called three other plumbers.  Between the three, I scheduled 7 (yes, seven) appointments.  All kept on being no-shows.  J Dodson plumbing, my fourth plumber, came out without any excuses, spent a couple hours troubleshooting, and fixed my problem.  Nice guy, extremely fair pricing. If I need a plumber again, he will definitely be my first call.",
      "date": "2018-11-15",
      "stars": 5
    },
    {
      "reviewer_name": "Benjamin Oxner",
      "text": "J. Dodson was on point! Fair and honest no  price gouging here! Big name  company quoted me over 300% what Jeremy did.  Likes what he does and you can see it in his work!  Very professional and personal! Will call again for sure!",
      "date": "2018-09-15",
      "stars": 5
    },
    {
      "reviewer_name": "Impact 360 Media",
      "text": "Great job and fair rates.",
      "date": "2018-08-27",
      "stars": 5
    },
    {
      "reviewer_name": "Kim Dodson",
      "text": null,
      "date": "2018-04-21",
      "stars": 5
    }
  ],
  "Quality Plumbing Solutions (ChIJIxGltkcTZYkR1CN3FFW0MAo)": [
    {
      "reviewer_name": "Anonymous",
      "text": "",
      "date": "Unknown date",
      "stars": 0
    }
  ],
  "A State Plumbing LLC (ChIJMzMR5v770ocRH73Tz3HiFYo)": [
    {
      "reviewer_name": "tommy joslin",
      "text": "Great Plumbing Company. Excellent/Friendly Staff. They will take care of any plumbing problem you have. Only plumbing company I will ever use",
      "date": "2025-02-07",
      "stars": 5
    },
    {
      "reviewer_name": "Donna Keaton",
      "text": "Everyone really cares.  Have used many times and are always on time or will call to update.  I have never had a bad experience or a do over.  Bill @ Donna",
      "date": "2024-12-02",
      "stars": 5
    },
    {
      "reviewer_name": "Jian Allen",
      "text": "A state is absolutely awesome! They’re been out to our home for multiple things and have always been upfront about not only pricing but what we really needed to get our problems fixed. They won’t sell you something you don’t actually need! The guys are super friendly and respectful every time they’ve came. I won’t use any one other than a state for any plumbing issue I ever have! These are my go to guys! Thanks again A state!",
      "date": "2024-07-18",
      "stars": 5
    },
    {
      "reviewer_name": "Joshua Matlock",
      "text": null,
      "date": "2024-05-30",
      "stars": 5
    },
    {
      "reviewer_name": "Genny Johnson",
      "text": "We are trying to sell our house and had a leak spring in a couple of our water heater pipes.  I called them and asked if they could have someone out as soon as possible and a couple of hours later the issue was fixed!! Bill and Keegan were very pleasant and helpful! Thank you!!",
      "date": "2024-01-29",
      "stars": 5
    },
    {
      "reviewer_name": "Joann Underwood",
      "text": "The plumbers arrived on time and quickly assessed our problem. We were told the procedure to get it replaced under our home warranty.   The report was promptly sent in.  They were very efficient and polite.",
      "date": "2024-01-05",
      "stars": 5
    },
    {
      "reviewer_name": "Jonathan Farrar",
      "text": "Quick, professional, and friendly! Would recommend and will hire again.",
      "date": "2024-01-02",
      "stars": 5
    },
    {
      "reviewer_name": "Pamela Pierron",
      "text": "I appreciate their prompt response and friendly service",
      "date": "2023-11-29",
      "stars": 5
    },
    {
      "reviewer_name": "Christine Reid",
      "text": "They went above and beyond to fix my problem, they didn't give up when it got difficult. Forever grateful and will definitely call them again for plumbing needs.",
      "date": "2023-09-09",
      "stars": 5
    },
    {
      "reviewer_name": "tim wood",
      "text": "Billy came out to fix our leak\nHe was punctual, professional, and answering any question I had.\nWe are happy with our service\nThank you",
      "date": "2023-07-31",
      "stars": 5
    },
    {
      "reviewer_name": "Tim Deaton",
      "text": "Simply amazing! Professionalism and quality, unmatched. If you are looking for a plumber, call these guys! They are the most honest and hard working in the state!",
      "date": "2023-07-26",
      "stars": 5
    },
    {
      "reviewer_name": "Laura Allmond",
      "text": "Professional, responsive, and worked quickly!",
      "date": "2023-06-20",
      "stars": 5
    },
    {
      "reviewer_name": "Travis Ratermann",
      "text": null,
      "date": "2023-05-02",
      "stars": 5
    },
    {
      "reviewer_name": "DeAnna Carter",
      "text": "They tried to fix my commode but it has to be replaced",
      "date": "2023-05-02",
      "stars": 4
    },
    {
      "reviewer_name": "Sonya Burrow",
      "text": "They were prompt to respond to my  request for service.  Technicians were very polite and professional.",
      "date": "2023-04-24",
      "stars": 5
    },
    {
      "reviewer_name": "Catherine Chapin",
      "text": null,
      "date": "2023-03-28",
      "stars": 5
    },
    {
      "reviewer_name": "Kaleah Stigall",
      "text": null,
      "date": "2023-02-02",
      "stars": 4
    },
    {
      "reviewer_name": "Chelsea Lee",
      "text": null,
      "date": "2022-09-21",
      "stars": 5
    },
    {
      "reviewer_name": "anthony davis",
      "text": "The up most amazing plumbing company, dependable, fast and great customer service",
      "date": "2022-08-11",
      "stars": 5
    },
    {
      "reviewer_name": "grand champ",
      "text": "A State Plumbing deleted my previous review so I'm reposting it. They don't want people knowing they do bad business. So here it is again. STAY AWAY find another Plumbing service. My toilet stopped flushing they came out to fix it.  I asked the tech while he was here to replace a clearly dry rotted handle. He told me this handle in the picture is fine even though the handle was clearly rotting and about to break. He said if I wanted it fixed I would have to put in another order paying full cost again. He said I'm supposed to specify everything wrong before they come out. How am I supposed to know everything causing the flushing problem I'm not a professional they are.  They were very unprofessional and greedy for more money find another plumbing service. I gave them a chance to make it right and they refused.",
      "date": "2022-05-31",
      "stars": 1
    },
    {
      "reviewer_name": "Chris Shroyer",
      "text": "We used this company a couple times for some issues with our plumbing and couldn't be happier. Great customer service and more importantly great work. It's no surprise to me this company continues to grow.",
      "date": "2021-09-03",
      "stars": 5
    },
    {
      "reviewer_name": "Ashley Kaiser",
      "text": "The Guys from A State were not only fast, friendly, and efficient... they also fit me in sooner than scheduled and came early. I will be using them from now on. Thank You.",
      "date": "2021-07-01",
      "stars": 5
    }
  ],
  "Bonafide Plumbing Services LLC (ChIJoV1V4U-lyYcRywnjX7r2w5k)": [
    {
      "reviewer_name": "Kim Edmondson",
      "text": "Fantastic guys & reliable 100%",
      "date": "2025-02-05",
      "stars": 5
    },
    {
      "reviewer_name": "Nash Electric",
      "text": "This company goes above and beyond. The prices are always fair and I know without a doubt it’s done right! No short cuts. Will always call them for my plumbing needs. Thanks again guys for the great work!",
      "date": "2025-01-14",
      "stars": 5
    },
    {
      "reviewer_name": "Cherel Perryman",
      "text": "They helped me with an installation of a gas range. Very professional!!",
      "date": "2022-08-31",
      "stars": 5
    }
  ],
  "Walthall Plumbing, LLC (ChIJYdrmfl0aMoYR5DR1oqIRBGI)": [
    {
      "reviewer_name": "Anonymous",
      "text": "",
      "date": "Unknown date",
      "stars": 0
    }
  ],
  "Mason Plumbing Co (ChIJ1QAIfhIYMoYRs05ObsRz8a8)": [
    {
      "reviewer_name": "Rosie Burns",
      "text": "Pleased with the service I received.",
      "date": "2023-03-06",
      "stars": 5
    },
    {
      "reviewer_name": "Dan Schwent",
      "text": "What a terrible experience not only with a very rude lady who answers the phone (telling me too get a life...at one time) but then the owner of the company who I thought I would have a conversation with just says...we do not do work for third parties and hung up on me!\n\nWhen I spoke to the lady trying to explain that I would pay them with a credit card or even give them my credit card information up front it did not matter. This place is a joke and deserves to be out of business for the lack of professionalism they BOTH illustrated. Do not be fooled by there answering machine that says...have a blessed day, should be more like.. unless you have cash up front we will not show up!!",
      "date": "2021-03-22",
      "stars": 1
    },
    {
      "reviewer_name": "Sabrina Coke",
      "text": "Awesome service. Very friendly staff from the call placed to the end of the service performed. Will definitely use for services in the future!!! Thanks for doing an awesome job",
      "date": "2020-10-20",
      "stars": 5
    },
    {
      "reviewer_name": "Adam Beebe",
      "text": "I call.  They show up.  They fix the problem for a good price.",
      "date": "2020-09-22",
      "stars": 5
    },
    {
      "reviewer_name": "Karla Jones",
      "text": "Mason Plumbing was very responsive. He came in and completed the job in a very short time. I would recommend MASON PLUMBING anytime. Thanks so much. We were NOT overcharged like the other plumber did us.  Thank you Thank You.",
      "date": "2020-06-02",
      "stars": 5
    },
    {
      "reviewer_name": "Paul Kinard",
      "text": "I called to have a hot water heater replaced and to repair a leaking toilet. Was charged over $850 for the hot water heater itself plus other charges for parts, labor, and various other \"fees\" totaling more than $1,400. Beware! Always ask for an estimate first.",
      "date": "2020-02-04",
      "stars": 1
    },
    {
      "reviewer_name": "Boris Miles",
      "text": null,
      "date": "2019-08-31",
      "stars": 5
    },
    {
      "reviewer_name": "jo baldridge",
      "text": "Great service and great guys, very professional and courteous. Always on time, honest, and just all round great service.  Honest, honest service!",
      "date": "2019-05-24",
      "stars": 5
    },
    {
      "reviewer_name": "Niki Smith",
      "text": "They always get to me quickly and provide quality work at reasonable prices. I've used Mason's for 20+ years and wouldn't go anywhere else!",
      "date": "2019-05-17",
      "stars": 5
    },
    {
      "reviewer_name": "Rachel Leimkuhl",
      "text": "Never been here",
      "date": "2019-05-09",
      "stars": 2
    }
  ],
  "Dusty's Heating & Air Conditioning Service (ChIJnes2Ye5hMYYR3NO_7GDpDhc)": [
    {
      "reviewer_name": "Anonymous",
      "text": "",
      "date": "Unknown date",
      "stars": 0
    }
  ],
  "Allan's Plumbing (ChIJN5VGPlD_LYYR7Ou8OYLzgow)": [
    {
      "reviewer_name": "Scott Hollis",
      "text": "Great plumber with good prices.  Great communication and hard worker.",
      "date": "2021-03-07",
      "stars": 5
    },
    {
      "reviewer_name": "Jonathan Smith",
      "text": "Remodeled a bathroom and he did the plumbing. Super nice guy, timely work...great service! Will hire again!",
      "date": "2020-04-20",
      "stars": 5
    }
  ],
  "Harper's Plumbing (ChIJJR6S1DgDM4YRZUTM-gAm8Eo)": [
    {
      "reviewer_name": "John Woods",
      "text": null,
      "date": "2024-01-30",
      "stars": 5
    },
    {
      "reviewer_name": "Lorraine Trotter",
      "text": "Luv it",
      "date": "2021-02-26",
      "stars": 5
    }
  ],
  "Plumb Perfect LLC (ChIJ7YwD1rwSnYcRzLVIcA90rh8)": [
    {
      "reviewer_name": "megan kelley",
      "text": "hard working and great customer service!!!",
      "date": "2023-11-29",
      "stars": 5
    }
  ],
  "CASCo Plumbing (ChIJf896jKtxMoYR_f3QBtorbqA)": [
    {
      "reviewer_name": "Stephanie Blessing",
      "text": "CASCo Plumbing is great. We were having issues at our home in Camden and CASCo was the one who responded. They were quick to fix the issue even with the complications that come along with an old home. Their pricing is also very reasonable.",
      "date": "2024-11-08",
      "stars": 5
    },
    {
      "reviewer_name": "Harmony Maxwell",
      "text": "Personable, efficient, timely. Cody is the best! He’s the only one I trust to work on my house. Thank you, for everything you’ve done for me!",
      "date": "2024-11-08",
      "stars": 5
    },
    {
      "reviewer_name": "Jessica Cook",
      "text": "Flexible with reasonable pricing, really they've been life savers when one of the old pipes in my house broke causing it to flood with dirt.",
      "date": "2023-08-29",
      "stars": 5
    },
    {
      "reviewer_name": "Kathey Walker",
      "text": "I called CASco Plumbing for help with a main drain clog. Cody and his helper worked for hours to resolve the issue. I found them to be friendly, professional, courteous and communicated very well what they had to do. They were prompt arriving and Cody charged a very reasonable price for a lot of hard work. I'll definitely use CASco again.",
      "date": "2021-05-26",
      "stars": 5
    },
    {
      "reviewer_name": "Chan P (Chan)",
      "text": "Kind, professional and very skilled. We will use him whenever we need a plumber!",
      "date": "2021-05-19",
      "stars": 5
    },
    {
      "reviewer_name": "Holly Mitchell",
      "text": "Great plumber, with great attitude even though he was clearly under the weather. Had an estimate a few weeks before project started and was able to cut cost even more once beginning. Would definitely reccomend!",
      "date": "2018-07-25",
      "stars": 5
    }
  ],
  "Nowlins Handyman Service (ChIJjZ5EJsN7LYYR1TJFmYyXxLI)": [
    {
      "reviewer_name": "Jodie Hicks",
      "text": null,
      "date": "2025-01-19",
      "stars": 1
    }
  ],
  "Pamplin services (ChIJt2CWiD6jLYYRMlcJZFlpdOo)": [
    {
      "reviewer_name": "Kaylen Johnson",
      "text": "They listened to the job I wanted done and delivered efficiently. The owner is very professional and cares about his customers.  I would recommend this company to anyone and without hesitation use them again in the future.",
      "date": "2020-03-14",
      "stars": 5
    },
    {
      "reviewer_name": "April Gardner",
      "text": "Great service and quality work. I highly recommend pamplin services to anyone.",
      "date": "2019-03-12",
      "stars": 5
    }
  ],
  "Crabtree Plumbing (ChIJ97NraeNgM4YRMjcopSkIr4s)": [
    {
      "reviewer_name": "Jessica Ridgell",
      "text": null,
      "date": "2024-12-29",
      "stars": 5
    },
    {
      "reviewer_name": "Michelle Orr",
      "text": "Excellent work. Fair prices. Very professional!",
      "date": "2024-02-22",
      "stars": 5
    },
    {
      "reviewer_name": "Sarah Cox",
      "text": null,
      "date": "2021-04-28",
      "stars": 5
    },
    {
      "reviewer_name": "Samantha Keeney",
      "text": "Lovejoy Diamond Screens would like to thank Justin Crabtree and his employees for their prompt and personable services. Would differently call him again if needed and highly recommend his quality work.",
      "date": "2021-01-17",
      "stars": 5
    },
    {
      "reviewer_name": "Ryan Hicks",
      "text": "Very unreliable. No call no show for three weeks. Call someone else.",
      "date": "2020-07-13",
      "stars": 1
    },
    {
      "reviewer_name": "Clay Crabtree",
      "text": null,
      "date": "2020-01-19",
      "stars": 5
    },
    {
      "reviewer_name": "Isol8r",
      "text": null,
      "date": "2018-07-17",
      "stars": 4
    },
    {
      "reviewer_name": "Donna Fugitt",
      "text": "Justin is excellent, prompt, knows his business. I recommend Justin as the best.",
      "date": "2017-09-21",
      "stars": 5
    }
  ],
  "LaRue Plumbing Inc (ChIJrehgvxROzYcR-YCz3kwduQM)": [
    {
      "reviewer_name": "chad aldridge",
      "text": "Mr. Steve and his team are great",
      "date": "2024-06-01",
      "stars": 5
    },
    {
      "reviewer_name": "Michael Bellinger",
      "text": "I had spent almost three days looking for my septic tank before I called LaRue. Although he already had a full days work, Steve found time to help me. In less than 30 minutes he'd found the tank & both service hatches, cleared the blockage & made arrangements to replace the old pipe. I'd give him 6 stars if I could.",
      "date": "2023-07-30",
      "stars": 5
    },
    {
      "reviewer_name": "Brett Polk",
      "text": null,
      "date": "2023-02-13",
      "stars": 5
    },
    {
      "reviewer_name": "Christopher Jones",
      "text": "During our renovation, we found an active water leak in our master bathroom. We called and they were able to work us into the schedule and got everything repaired very quickly. The two guys that came out were very professional and did an awesome job! Pretty affordable too considering how fast they got to us. Very pleased.",
      "date": "2022-01-07",
      "stars": 5
    },
    {
      "reviewer_name": "Jamie Burton",
      "text": "Excellent service",
      "date": "2021-12-03",
      "stars": 5
    },
    {
      "reviewer_name": "Kenneth Opper",
      "text": "Very, personable, clean and neat. Explained the problem with kitchen faucet not attached right, slow water flow and corrosion around base. He brought the replacement, quoted a price for installation and then was under his quote by $25. He let me pick the faucet style and finish through photos in text message. I would highly recommend this plumber.",
      "date": "2021-08-24",
      "stars": 5
    },
    {
      "reviewer_name": "Jacque Rice",
      "text": "Good luck! I would leave a comment if they ACTUALLY did any work. Never could get a response back.",
      "date": "2021-04-25",
      "stars": 1
    },
    {
      "reviewer_name": "Janet Hill",
      "text": "LaRue Plumbing is the best!  Right in the middle of two snow storms, which we know is rare for Arkansas, they came over and replaced our cracked toliet.  Excellent company!",
      "date": "2021-04-16",
      "stars": 5
    },
    {
      "reviewer_name": "Matthew Bolding",
      "text": "Mr. LaRue was unable to fit me in his schedule for same day service, but did spend about 10 minutes in the phone with me explaining some possible fixes to my plumbing problem. Very pleasant, and great advice.",
      "date": "2020-09-09",
      "stars": 5
    },
    {
      "reviewer_name": "Charles Penfield",
      "text": null,
      "date": "2020-07-11",
      "stars": 5
    },
    {
      "reviewer_name": "Frank Jennings",
      "text": "Am in need of a plumber to repair a leak., Called him twice and he never returned my call. At least he could have called. Won't call again.\nF. L. J.",
      "date": "2020-05-16",
      "stars": 1
    },
    {
      "reviewer_name": "Kenneth Giesbrecht",
      "text": "Awesome experience. Family owned and operated, professional and quick. They fixed our problem and we couldnt be happier, we are working on starting other projects around our property and intend to use La Rue's plumbing to get it all done.",
      "date": "2020-01-15",
      "stars": 5
    },
    {
      "reviewer_name": "Paul Johnston",
      "text": null,
      "date": "2019-12-31",
      "stars": 5
    },
    {
      "reviewer_name": "Greg Hill",
      "text": "Steve was great! Very professional and affordable. Glad to have found a reliable plumber which seems impossible these days. I appreciated the fact that they were good to not track in mud or dirt as we had issues with the sewer line. We'll definitely be using them again!!",
      "date": "2018-09-06",
      "stars": 5
    },
    {
      "reviewer_name": "Corey Melton",
      "text": "Steve was really great about squeezing me in due to a plumbing emergency. He addressed the issues I had and took the time to discuss potential future issues and how to address them. Very good, very quick, and very professional.",
      "date": "2018-08-01",
      "stars": 5
    },
    {
      "reviewer_name": "Brandy Nichols",
      "text": "Steve was so professional and knowledgeable. I knew right away this was a trust worthy company! Extremely fair prices and quality work! Also very quick service! Have found our go to plumber for all needs!",
      "date": "2018-06-01",
      "stars": 5
    },
    {
      "reviewer_name": "Chris Childers",
      "text": "I called over one week in advance to schedule a small plumbing job.\nWe both agreed on the following Monday or Tuesday; it is now Tuesday 4:00 p.m.\nWhen I call he rejects the call.\nI called a very compitent plumber by the name of Chris Dyer, he is on his way.\nIf you ever have any plumbing issues call Chris.",
      "date": "2018-03-27",
      "stars": 1
    },
    {
      "reviewer_name": "Richard Campbell",
      "text": "Replaced my water heater when it was leaking. He was very clean and polite.  In and out in an hour.  Also replaced my water regulator a year back when it busted.  He is my go to plumber.",
      "date": "2017-12-28",
      "stars": 5
    },
    {
      "reviewer_name": "Brennamartinez01 ___",
      "text": "The two men who showed up to replace her hot water heater which rusted open and was gushing hot water everywhere we jerks to say the least worst customer service I have personally ever seen. They charged her 900 plus tax for not even a hour worth of work 450 for the hot water heater and the rest in labor they didn't clean up any water I did I borrowed the neighbors shop vac and removed the water they just rolled in a new hot water heater and left they opened the back door didn't say anything and just let her cat out.  On the way out they only thing he said was that i could clean up the house now which was obviously a mess from the gushing water. They also ripped her floor by moving her washer and dryer which was extremely soft from the hot gushing water they have no respect for personal property not worth your money choose anyone else it's the biggest rip off in Benton. If give them no stars if It would let me what a joke.",
      "date": "2017-10-24",
      "stars": 1
    },
    {
      "reviewer_name": "Benjamin Smith",
      "text": "All-around good guy, honest and straight shooter. Was able to help me with an issue over the phone where as others would have charged a fee for the information.",
      "date": "2017-08-18",
      "stars": 5
    },
    {
      "reviewer_name": "Tiffany Woodall",
      "text": null,
      "date": "2017-08-15",
      "stars": 1
    },
    {
      "reviewer_name": "jillian carter",
      "text": null,
      "date": "2017-05-25",
      "stars": 5
    },
    {
      "reviewer_name": "arvin williams",
      "text": "Steve La Rue and his guys are great ! We have use them for both business and personal issues and the always do a great job.\nPrompt service with reasonable prices !",
      "date": "2017-05-03",
      "stars": 5
    },
    {
      "reviewer_name": "Empire Kids",
      "text": "Steve  and his crew are top notch!!  They are professional, timely, and available within minutes.  After completing a remodelling job at our new 18,000 sq. ft facility, LaRue Plumbing is now working on a remodel at a 2nd business location for us.  I would not only recommend him for commercial work but also residential remodeling, repair, and service calls.  You won't be disappointed.",
      "date": "2017-05-03",
      "stars": 5
    },
    {
      "reviewer_name": "Zac McCauley",
      "text": "Steve has helped us on many many projects.  Very professional and always cares about our issues.  Highly recommend him if you have any plumbing needs!",
      "date": "2017-05-03",
      "stars": 5
    },
    {
      "reviewer_name": "Rick bellinger",
      "text": "Had a water heater that had to be changed before we could get the permit to open our new restaurant.  Steve came within the hour and had me fixed up in 30 minutes.  Got us past our inspection and back on schedule to open on time.   Thanks Steve",
      "date": "2017-04-05",
      "stars": 5
    },
    {
      "reviewer_name": "Robert Hill",
      "text": "Steve stopped by to help fix a pipe that slipped out under pressure and when he arrived it had already been repaired.  He still stuck around to talk with us about other plumbing related items we had upcoming with plans for the addition of a bathroom and refused to let us pay him for his time.  His professionalism and courtesy were top notch and we'll be recommending him to everyone in the Benton, AR area.\n\nThanks Steve!",
      "date": "2016-12-05",
      "stars": 5
    },
    {
      "reviewer_name": "Lauren Clow",
      "text": "What a great company! Easy to work with, high quality work, and overall a very pleasant expierence. I will forever use LaRue plumbing for all our plumbing needs!",
      "date": "2016-09-25",
      "stars": 5
    },
    {
      "reviewer_name": "Christine Clement",
      "text": "When I had a gas leak in my yard, Centerpoint pulled my meter and told me I was responsible for getting the line fixed.  Just call a plumber.  Well I didn't know any plumbers and just got the phone book.  I was very blessed when I called Steve Larue.  He was knowledgeable, helpful and prompt.\nHis company is very thorough and easy to work with.  He went out of his way to find out about the gas company moving meters and saved me $1400.00 on my job. I will recommend Larue to everyone and I will use him again.  He is now my go to guy.  I wish him and his the best. May I add that I am a single, disabled woman and never once felt like I was being taken advantage of.",
      "date": "2015-12-29",
      "stars": 5
    },
    {
      "reviewer_name": "Perry Y",
      "text": "We have used LaRue Plumbing for our home several times.  Steve LaRue and his company are top-notch.  He is always available for an emergency, and always gets the job done at reasonable prices.  Good small business and a good plumber.",
      "date": "2015-06-17",
      "stars": 5
    }
  ]
}