[
  {
    "reviewer_name": "JG Rand",
    "text": "He came out within an hour on a Sunday and got the toilet unclogged and working again in a few minutes. I would definitely use his service again!",
    "date": "2025-02-16",
    "stars": 5
  },
  {
    "reviewer_name": "Danna Kelley",
    "text": "I would highly recommend Doug to anyone. He is an excellent plumber and  an honest, trustworthy person. I have known Doug for years and you can’t find a more dependable and capable person.",
    "date": "2025-02-15",
    "stars": 5
  },
  {
    "reviewer_name": "Amy Starling",
    "text": "Doug is very knowledgeable, dependable, and has impeccable work ethic. I have used him for more than a year and wouldn’t use anyone else for my plumbing needs.",
    "date": "2025-02-15",
    "stars": 5
  },
  {
    "reviewer_name": "Christen Taylor",
    "text": "Doug was absolutely fantastic. Great service and fixed our water leak & issue in no time! 10/10 recommend!",
    "date": "2025-02-10",
    "stars": 5
  },
  {
    "reviewer_name": "courtney burton",
    "text": "I highly recommend Doug and 1st call plumbing!! He is very dependable, professional, hardworking, and personable!!! I am thrilled to find a plumber that I can depend on! I will definitely use him again in the future!!",
    "date": "2025-02-06",
    "stars": 5
  },
  {
    "reviewer_name": "Rhonda W",
    "text": "Doug has been my plumber for a few years now. He is very pleasant to work with. Everytime he has been here to work he has done an amazing job. I recommend him for all your plumbing needs. His pricing is very competitive and his work is very neat and complete.  We highly recommend 1st Call Plumbing.",
    "date": "2025-01-15",
    "stars": 5
  },
  {
    "reviewer_name": "Billie Jean Williams",
    "text": "Great service!!",
    "date": "2025-01-09",
    "stars": 5
  },
  {
    "reviewer_name": "Diana Wells",
    "text": "Doug was very easy to work with. We had a    problem with our water under a concrete slab. We dug it out, he fixed the problem, and he stayed until we got it back together to ensure that everything was okay. He was efficient, effective, and very reasonably priced! We will continue to use him if any other needs arise!",
    "date": "2025-01-04",
    "stars": 5
  },
  {
    "reviewer_name": "Denton Johnston",
    "text": "1st Call Plumbing was very professional when I had plumbing problems.. 1st Call Plumbing diagnosed and fixed the problem in a very timely manner  and done the job for a lot less than anyone else I contacted.. AAAAA+++++++ 1st Call Plumbing is the only Plumbing Service I will use in the future..",
    "date": "2024-12-29",
    "stars": 5
  },
  {
    "reviewer_name": "Evan Wilson",
    "text": "Showed up when he said he was going to, worked fast, efficient , explained my issues and had them fixed with preventative ideas and more than enough information to help my home. Me and my family have working toilets again and that’s a thank you I cannot express\n\nFirst call everytime !!",
    "date": "2024-12-29",
    "stars": 5
  },
  {
    "reviewer_name": "Shannon Norris",
    "text": "Excellent work, timely, honest, and reliable!!  I would recommend 1st Call Plumbing, without any hesitation!!!",
    "date": "2024-12-26",
    "stars": 5
  },
  {
    "reviewer_name": "Caleb Reinhart",
    "text": "Had a plumbing issue on a Sunday and Doug arrived within 30 minutes to help! Very knowledgable and even took time to explain to us what was going on and how to prevent issues in the future.. Got us back up and running in no time. Will definitely be using him going forward!",
    "date": "2024-12-15",
    "stars": 5
  },
  {
    "reviewer_name": "Ronisha “Niki” Baker",
    "text": "This was my first time using this company and I am beyond impressed. The job was done in a timely and affordable fashion and on a Saturday!! I was given all the facts about the job at hand and some issues to keep an eye on. I really appreciated the transparency. I will definitely be making 1st call my first call for all my plumbing needs!! Thank you so much!!",
    "date": "2024-12-08",
    "stars": 5
  },
  {
    "reviewer_name": "Adrian Rodriguez",
    "text": "Amazing service, came quicker than expected, and very friendly. Cleaned up job area very well too!  highly recommend!",
    "date": "2024-12-03",
    "stars": 5
  },
  {
    "reviewer_name": "Jennifer Barker",
    "text": "Quick service and got the job done early. We were selling and had some pluming issues to be resolved. Doug got right on the call and made sure issues were resolved same day. Can’t say enough great things about 1st Call!!",
    "date": "2024-11-30",
    "stars": 5
  },
  {
    "reviewer_name": "Mary Thomas",
    "text": "I have used Doug for several years for my plumbing needs and such an honest, hardworking guy. He knows his stuff well and it reflects in his organization while working and the respect he shows his client's homes. I highly recommend him to anyone needing this kind of service! I can not say enough good!",
    "date": "2024-11-30",
    "stars": 5
  },
  {
    "reviewer_name": "Jennifer Calvert ND",
    "text": "I called 1st Call Plumbing at 8pm on a Friday evening with a plumbing emergency (when my washing machine spun, water would pour out from under my toilet and flood the bathroom) Doug answered immediately and he was here within 30 minutes (I’m in Paragould and he was in Jonesboro) This was not an easy job due to the location of the clean outs (which weren’t even on this property) but Doug worked tirelessly in the dark to get to the bottom of this rental property’s plumbing issue. He located the clean outs hundreds of feet from the house and got it cleaned out. He was very professional, knowledgeable, cleaned up after himself, and was thorough in his work. I highly recommend him for any and all of your plumbing needs in northeast Arkansas. I can’t express how grateful I am for his help!",
    "date": "2024-11-23",
    "stars": 5
  },
  {
    "reviewer_name": "Christie York",
    "text": "Fast response and Great service.  Always willing to help.  Always friendly",
    "date": "2024-10-16",
    "stars": 5
  },
  {
    "reviewer_name": "Tahnee Anderson",
    "text": "I was so grateful to run up on this listing on an early Saturday morning after waiting all week for several plumbers to return my phone call or show up one call in and he called me right back and pulled up and resolved my issues with no problems great work ethic and loving personalities from him and his wife thru the phone will recommend him and continue to use his services DOUG IS THE GREATEST",
    "date": "2024-07-13",
    "stars": 5
  },
  {
    "reviewer_name": "Keith Chitmon",
    "text": "Could not be happier with 1st call. They go above and beyond to help me when needed no matter what time of day or week. My highest possible recommendation.",
    "date": "2024-06-17",
    "stars": 5
  },
  {
    "reviewer_name": "Gary M",
    "text": "Didn't finish the job and didn't stay in contact with me. It's like he didn't care. I wouldn't recommend his services.",
    "date": "2024-10-08",
    "stars": 1
  },
  {
    "reviewer_name": "Diana Moore / Turner",
    "text": "Do Not call this man,my mother made that mistake,she needed a faucet fixed,he charged my mother who is in her 70\"s ,$432.50. ,charged her $110.00 for his self $110.00 for the young boy who he said was in training and stood there doing nothing, charged her $85.00 to go get a seal, from Black Rock to Pocahontas ,material and gas$127.00. and the faucet still isn't fixed.WOW...",
    "date": "2024-01-23",
    "stars": 1
  },
  {
    "reviewer_name": "Susan Haley",
    "text": null,
    "date": "2023-11-10",
    "stars": 5
  },
  {
    "reviewer_name": "Rebecca Belt",
    "text": null,
    "date": "2023-10-01",
    "stars": 1
  },
  {
    "reviewer_name": "Michelle Metcalf",
    "text": null,
    "date": "2023-09-30",
    "stars": 1
  },
  {
    "reviewer_name": "Michelle Metcalf",
    "text": null,
    "date": "2023-09-29",
    "stars": 1
  },
  {
    "reviewer_name": "Rachel Jordan",
    "text": "Johnny is by far the best around. He’s always so sweet and does an amazing job. I wouldn’t trust anyone else. If you need a plumber he’s the best!",
    "date": "2023-03-13",
    "stars": 5
  },
  {
    "reviewer_name": "Melvina Hunt",
    "text": "They done a real good job and was very nice",
    "date": "2023-03-09",
    "stars": 5
  },
  {
    "reviewer_name": "kerryncasey stevens",
    "text": "Number disconnected left a note no reply...",
    "date": "2022-09-15",
    "stars": 1
  },
  {
    "reviewer_name": "Gary Walker",
    "text": "Put in a gas line for our new gas fireplace. Done a good job. Highly recommend him.",
    "date": "2022-08-06",
    "stars": 5
  },
  {
    "reviewer_name": "Sandy Morris",
    "text": "Could not get him to return calls or show up",
    "date": "2022-06-02",
    "stars": 1
  },
  {
    "reviewer_name": "Joseph Carpenter",
    "text": "Absolutely the best! with all the bad luck going on with my house it was a very big relief having somebody come out to do the job and be done and only minutes it was awesome they were very nice and worked with a smile. very much appreciate them. I will no longer try to do plumbing myself. these are are my go to guys from here on out.",
    "date": "2022-05-24",
    "stars": 5
  },
  {
    "reviewer_name": "syvilla priest",
    "text": null,
    "date": "2021-11-15",
    "stars": 5
  },
  {
    "reviewer_name": "MelNLavon Patterson",
    "text": "They did great! Cleaned everyone of our pipes, made everything drain great & fixed the problem! Would 100% use them again! They did amazing!",
    "date": "2021-06-15",
    "stars": 5
  },
  {
    "reviewer_name": "Travis Middlecoff",
    "text": "All of my pipes were backing up causing a huge mess. They came out quickly and got the job done! Extremely friendly, great service, quick, knowledgeable and also communicated what was going on throughout working the job. I was worried the price would be high, as most plumbers/repairmen are, but the price was more than reasonable! I’m highly satisfied, and all of these positive reviews are well deserved. I will use and recommend Johnny Thomas for all future plumbing needs!",
    "date": "2020-12-29",
    "stars": 5
  },
  {
    "reviewer_name": "shawna clements",
    "text": "Good people did amazing job with my plumbing work recommended them to anyone they was on time very professional andover all great service I will use them again if I ever need have plumbing issues again",
    "date": "2020-06-09",
    "stars": 5
  },
  {
    "reviewer_name": "Lexi Buckwalter",
    "text": "They were so nice while they were here. They got back to me quickly and  they made sure that my problem was fixed. They didn't charge me a ton of money and they did so good fixing my problem. I had several people turn me down when I called. They were the only ones who would help me and they were amazing.",
    "date": "2020-04-22",
    "stars": 5
  },
  {
    "reviewer_name": "Ericka Carter",
    "text": "These men were incredible.... they were very informative of what was going on with my sewer line and they were really nice and very professional. I recommend them to anyone looking for a trusty plumber.",
    "date": "2020-03-25",
    "stars": 5
  },
  {
    "reviewer_name": "Corey Gilliland",
    "text": null,
    "date": "2020-03-23",
    "stars": 5
  },
  {
    "reviewer_name": "Carol Arnold",
    "text": "They were professional and nice. I will be using them for all my plumbing work!",
    "date": "2020-03-18",
    "stars": 5
  },
  {
    "reviewer_name": "A B",
    "text": "The owner, Doug was quick to respond and came out the same day. He went right to work but did not mind answering all of my questions! You won’t go wrong calling 1st call ☎️",
    "date": "2024-05-30",
    "stars": 5
  },
  {
    "reviewer_name": "peggy jeffries",
    "text": "Doug Parks with 1st Call Plumbing is great!  A true professional, very knowlegeable and reliable!",
    "date": "2024-05-22",
    "stars": 5
  },
  {
    "reviewer_name": "Josh Little",
    "text": "Doug is awesome! I'm an engineer and do-it-yourselfer and he spent a lot of time answering my questions.  He is intelligent and does great work.  I really appreciate a professional taking the time to explain things.  Time is money, but he makes the customer feel worth his time.  I will definitely continue to use him for all my plumbing needs.  I can't recommend him highly enough!",
    "date": "2024-05-17",
    "stars": 5
  },
  {
    "reviewer_name": "Colby George",
    "text": "Great work, fast and very trustworthy! I’ve recommended him to multiple people, and he’s great with working with you on any project! Don’t waste your money on others. Go with Doug!",
    "date": "2024-05-16",
    "stars": 5
  },
  {
    "reviewer_name": "john meads",
    "text": "Doug is the Best! I have been using Doug for a little over a year now and he has basically done it all for me. Water heaters, toilet issues, sink issues and emergency leaks that had to be addressed immediately! Doug is very responsive, hard worker, friendly, a fast and high quality plumber!",
    "date": "2024-05-15",
    "stars": 5
  },
  {
    "reviewer_name": "tom perrine",
    "text": "Ethan came out when he said he was. Actually  earlier.  He fixed my plumbing  issues in a timely  manner.  I would use him again for any future  plumbing  needs.",
    "date": "2025-01-23",
    "stars": 5
  },
  {
    "reviewer_name": "Molly Dutton",
    "text": "Came when he said he would and very quick to respond to messages. Appreciate him addressing my concerns and getting us fixed up.",
    "date": "2024-12-13",
    "stars": 5
  },
  {
    "reviewer_name": "Holden Smith",
    "text": null,
    "date": "2024-12-12",
    "stars": 5
  },
  {
    "reviewer_name": "Alan Bowman",
    "text": "Ethan repaired a leaky faucet and replaced a toilet for our home. Ethan was professional and worked in a timely manner. Highly recommended!",
    "date": "2024-12-03",
    "stars": 5
  },
  {
    "reviewer_name": "Charlotte Seats",
    "text": "I recommend Ethan Barkley Plumbing for all your plumbing needs. He is very trustworthy & does great quality work. Ethan was quick to come out & fix my water leak. I would rate his service a 5 Star!  Jerry Seats",
    "date": "2024-11-07",
    "stars": 5
  },
  {
    "reviewer_name": "Keelin Fullen",
    "text": "My landlord wouldn’t fix my sink, and Mr Barkley was my saving grace… he got it fixed right up with a fast and quality service",
    "date": "2024-08-24",
    "stars": 5
  },
  {
    "reviewer_name": "Amber Morgan",
    "text": "Highly recommend Barkley Plumbing and Septic. I had a line from my hot water heater leaking in my attic and Ethan was able to replace the entire water line by the next day for a fair price.",
    "date": "2024-08-03",
    "stars": 5
  },
  {
    "reviewer_name": "Sammy Waller",
    "text": "Ethan is very personable and does neat work. Reasonable pricing for a last minute kitchen sink install. I have a new plumber.",
    "date": "2024-06-29",
    "stars": 5
  },
  {
    "reviewer_name": "Chance Austin",
    "text": "Needed a new kitchen faucet installed, called Ethan on a Wednesday night and he was there Thursday morning. Did great work for a fair price and easily the best Plummer I have dealt with.  I would recommend Ethan to anyone in need of quick and quality work.",
    "date": "2024-06-29",
    "stars": 5
  },
  {
    "reviewer_name": "Tanner Cecil",
    "text": "Broke a water spigot while washing my truck. Called Barkley plumbing and he was able to come out within the next hour and got me fixed up quick. Great quality work and in a timely manner! Thank you!",
    "date": "2024-06-29",
    "stars": 5
  },
  {
    "reviewer_name": "AmericanPride 1776",
    "text": "I came home to a broke water faucet for my washer machine. These guys came out quick and were able to get me taken care of without breaking the bank. Will use again.",
    "date": "2024-06-26",
    "stars": 5
  },
  {
    "reviewer_name": "David Rogers",
    "text": "Very respectful and does quality work",
    "date": "2024-06-26",
    "stars": 5
  },
  {
    "reviewer_name": "Kira Hand",
    "text": "Great service, fast and friendly! Will use for all plumbing needs!!",
    "date": "2020-03-12",
    "stars": 5
  },
  {
    "reviewer_name": "Lucas Heer",
    "text": null,
    "date": "2020-03-11",
    "stars": 5
  },
  {
    "reviewer_name": "Shaun Thomas",
    "text": null,
    "date": "2020-02-26",
    "stars": 5
  },
  {
    "reviewer_name": "Bob Dyess",
    "text": null,
    "date": "2018-10-20",
    "stars": 3
  },
  {
    "reviewer_name": "Rhonda Pattillo",
    "text": null,
    "date": "2023-04-12",
    "stars": 5
  },
  {
    "reviewer_name": "Joyce Roberts",
    "text": "He didn't fix the problem the first time and had to come back, yet he charged me twice.",
    "date": "2023-01-08",
    "stars": 1
  },
  {
    "reviewer_name": "Marie Taggart",
    "text": "Refused to come out in an emergency.  I wish I could give zero stars. 👎",
    "date": "2021-02-19",
    "stars": 1
  },
  {
    "reviewer_name": "Darrick Gore",
    "text": "I give this company a five star rating. They were on time and very flexible with answers and payment of the job. Superb work!!!",
    "date": "2023-12-09",
    "stars": 5
  },
  {
    "reviewer_name": "Brad Dyer",
    "text": "Honest dependable service at a reasonable price",
    "date": "2023-03-05",
    "stars": 5
  },
  {
    "reviewer_name": "Mable See Olson",
    "text": "We called them and finally talk to one and they said they would be out but never came out its been over two weeks and no phone call back or showen up. They use to be great and this has never happen in the past .first time",
    "date": "2023-01-31",
    "stars": 1
  },
  {
    "reviewer_name": "Amy Campbell",
    "text": null,
    "date": "2021-12-08",
    "stars": 5
  },
  {
    "reviewer_name": "Darold jr Ogles",
    "text": null,
    "date": "2021-07-30",
    "stars": 5
  },
  {
    "reviewer_name": "Doris Franklin",
    "text": "Does the job right the first time for the best price.",
    "date": "2020-01-31",
    "stars": 5
  },
  {
    "reviewer_name": "taylor harris",
    "text": "Does great plumbing very reasonable and reliable",
    "date": "2018-07-09",
    "stars": 5
  },
  {
    "reviewer_name": "david_ kg1984",
    "text": "We are building a home and ogles plumbing did the plumbing. They were off on two sinks, two toilets and one bath tub. That is several measurements to be off. We were going to do stained concrete in two of the bathrooms but have to tile now because we had to jack-hammer the concrete. I would not recommend ogles to anybody.",
    "date": "2018-05-17",
    "stars": 1
  },
  {
    "reviewer_name": "Ed X",
    "text": null,
    "date": "2018-01-12",
    "stars": 1
  },
  {
    "reviewer_name": "Clint Jackson",
    "text": "Tanner took care of my new construction plumbing quickly and professionally. I highly recommend him for plumbing custom homes.",
    "date": "2025-01-03",
    "stars": 5
  },
  {
    "reviewer_name": "Brandon Haley",
    "text": "These guys are great. Showed up and showed out! Had my sink fixed in about an hour and it looks so much better I’d recommend them to anyone.",
    "date": "2023-03-05",
    "stars": 5
  },
  {
    "reviewer_name": "Anonymous",
    "text": "",
    "date": "Unknown date",
    "stars": 0
  },
  {
    "reviewer_name": "Madison Griffin",
    "text": "Great job and great guys! They knocked out our plumbing work for our house so quick and good! Better communicators than most the other construction people!",
    "date": "2024-09-12",
    "stars": 5
  },
  {
    "reviewer_name": "Loren Allison",
    "text": null,
    "date": "2023-03-24",
    "stars": 3
  },
  {
    "reviewer_name": "Dana Simpkins",
    "text": "I would recommend to anyone!",
    "date": "2020-12-18",
    "stars": 5
  },
  {
    "reviewer_name": "Gabriel Black",
    "text": "Unbelievably bad. Horrible communication. No showed on commercial project for weeks could never get ahold of him. Matt Parnell said he was gonna submit our permits and never did. Never heard back till I called office and put us way way behind schedule on opening. DONT NOT USE THESE PEOPLE.",
    "date": "2019-12-09",
    "stars": 1
  },
  {
    "reviewer_name": "Joshua Byard",
    "text": "BEWARE!!! Very unprofessional. They finished the final portion of the job four days ago and text me at 9:55pm to tell me they are placing a lien on my construction site if I didn't pay them by noon the next day. Poor customer service. Took two months to get them to finish the job. I had to call multiple times, and they wouldn't return my calls. DON'T CALL THEM.",
    "date": "2019-08-23",
    "stars": 1
  },
  {
    "reviewer_name": "Kasie Fagan",
    "text": null,
    "date": "2019-05-27",
    "stars": 5
  },
  {
    "reviewer_name": "Amanda Jones",
    "text": "Very nice environment and the people are very helpful",
    "date": "2018-10-07",
    "stars": 5
  },
  {
    "reviewer_name": "Jonathan “Suttonio” Sutton",
    "text": "Great people, fantastic work, trustworthy for multiple reasons:\n\nCalled them due to, what I would describe as, a scratching noise coming from my return vent whenever unit was running. Called Aaron and they came right over, pulled the part and commenced to explain what was going on. At the time I didn’t have the money but despite all that they treated me like a paying customer. Even telling me if it goes out over LABOR DAY WEEKEND, of all weekends, we have options. Just call us. Glad it didn’t come to that. When I came up with the money for them to order and fix the issue they came right over. They kept me informed during the whole process, went above and beyond to check for other issues. They have been to my house multiple times and are always very courteous and willing to explain, in detail, the issues you’re having and how they are going to rectify them. Problem is most ppl don’t listen, but I digress. They don’t leave a mess as you can see from the picture, they went out of their way to maintain cleanliness and that’s much appreciated and most of the time overlooked and under praised. They even came today when my son was sleeping and managed to maneuver around quiet enough to where he didn’t even wake up till he finished his nap. I’m not sure how. Fair prices, good work, nice people. Will not be using anyone else, these guys are good to have in your contact list.",
    "date": "2024-09-04",
    "stars": 5
  },
  {
    "reviewer_name": "Travis Thacker",
    "text": "Did a good job and got my furnace fixed in no time!",
    "date": "2024-01-19",
    "stars": 5
  },
  {
    "reviewer_name": "Courtney Stringer",
    "text": null,
    "date": "2023-08-21",
    "stars": 5
  },
  {
    "reviewer_name": "Robert Schulze",
    "text": null,
    "date": "2023-08-20",
    "stars": 1
  },
  {
    "reviewer_name": "Jonathan Keasler",
    "text": "Our work office was constantly hotter than outside. 80 degrees outside, 85 in the office.\nAfter just a few hours, it holds a steady 65!! Even with the doors constantly in use. Work life this summer will no longer be miserable!!\nThank you from all of us at NEAR Ready Mix Paragould, AR.",
    "date": "2023-07-12",
    "stars": 5
  },
  {
    "reviewer_name": "Danna Lee Holt",
    "text": "These folks were on time, efficient, professional, personable, and best of all they provide quality services! We are incredibly grateful for ya'll and to finally be able to escape the heat and cool down!! Thank ya'll so very much for your time and energy!!\n-The Near Ready Mix Paragould Plant",
    "date": "2023-07-12",
    "stars": 5
  },
  {
    "reviewer_name": "cathy hall",
    "text": "They show up when they say, usually the same day.  Everything is good when they leave.  They clean up after themselves.",
    "date": "2023-05-17",
    "stars": 5
  },
  {
    "reviewer_name": "Josh Dowler",
    "text": null,
    "date": "2023-04-11",
    "stars": 5
  },
  {
    "reviewer_name": "Marwan Grera",
    "text": "Great people, had a project they don't the kind I want but helped me with great information and connecting me with who can help me. I recommend highly",
    "date": "2023-02-07",
    "stars": 5
  },
  {
    "reviewer_name": "Tripp",
    "text": "Great guy, very informative and helpful with information. Will be using in the future.",
    "date": "2022-03-24",
    "stars": 5
  },
  {
    "reviewer_name": "David m Manley",
    "text": "He has a good repair service.",
    "date": "2022-01-04",
    "stars": 5
  },
  {
    "reviewer_name": "Curtis Burns",
    "text": "Wonderful they were so nice ..and more then fair",
    "date": "2021-12-15",
    "stars": 5
  },
  {
    "reviewer_name": "Kelly Roberts",
    "text": "Amazing people, so happy to have them as my go to company now! Thank you",
    "date": "2021-06-23",
    "stars": 5
  },
  {
    "reviewer_name": "John Green",
    "text": "My outside AC fan stopped and I needed a specific capacitor after 5 pm on a weekday. This business owner let me come pick up from his shop same day and it fixed my problem. He also followed up next day to make sure that it indeed fixed it. Very nice guy. Highly recommended",
    "date": "2021-06-16",
    "stars": 5
  },
  {
    "reviewer_name": "Dustin Dancer",
    "text": "Called to get on the schedule, they came within an hour to fix the issue. Very quick and professional. Would recommend for sure.",
    "date": "2021-04-14",
    "stars": 5
  },
  {
    "reviewer_name": "Chris Salehi",
    "text": "Absolutely amazing company to work with.  Always on time and answers all the questions you have. Very reasonable and friendly.",
    "date": "2021-03-02",
    "stars": 5
  },
  {
    "reviewer_name": "Josh Wise",
    "text": "Great service! They answered my call on a Saturday as soon as I called in the morning. They said they could check my issue that afternoon which they did. They kept me up to date on when they were on their way to my house and when my part came in, the cost, and with any questions I had. They had my air handler unit up and going in 30 minutes. I tried contacting 7 or so HVAC businesses in Paragould that day and only two answered my call. Mid-South was the only one that could help me, the other couldn't get a tech to me, but actually recommended me to call Mid-South. The others that I could leave messages with haven't even returned my call still. I'll use Mid-South again for sure!",
    "date": "2020-12-31",
    "stars": 5
  },
  {
    "reviewer_name": "Matthew McFadden",
    "text": null,
    "date": "2020-07-20",
    "stars": 5
  },
  {
    "reviewer_name": "Keith Vangilder",
    "text": "Had one of our old air conditioners go out. Aaron promptly come out and try to put a bandaid on it until we could get it fixed. I knew it needed to be replaced but he still took the time to show us options and in the end was able to match our existing units. Literally charged half of the other people we called for a quote. I won’t be calling anyone else.",
    "date": "2020-07-18",
    "stars": 5
  },
  {
    "reviewer_name": "Shane Williams",
    "text": "These guys are the best, very nice, reasonably priced, knowledgeable, on time and had to fix the last guy's mistake on my unit, I have nothing but great things to say about this business and will definitely be using them again, thanks guys.",
    "date": "2020-06-29",
    "stars": 5
  },
  {
    "reviewer_name": "Rachel South",
    "text": "Called to get a quote on diagnosing an issue with my HVAC, and they came within the hour to fix the issue. Very quick, professional, and friendly. Would definitely use again.",
    "date": "2020-06-19",
    "stars": 5
  },
  {
    "reviewer_name": "Verlis Guinn",
    "text": "Aaron came right out and fixed our heat pump on a Saturday!  He's a friendly fella and he took the time to explain what he was doing. Breath of fresh air! Don't hesitate to call him if you have some AC/Heat issues.",
    "date": "2020-03-16",
    "stars": 5
  },
  {
    "reviewer_name": "Caitlin Owens",
    "text": "Our ac went out in the middle of summer. They came out the very next day after I called them and worked till around 9pm trying to fix it. There was another part that was messed up so they had to come back the next day(not at all their fault). He was very friendly and professional. The price was 200 to 300 less than most of the other places I called. I will definitely use them again in the future!",
    "date": "2020-01-15",
    "stars": 5
  },
  {
    "reviewer_name": "James Safirt",
    "text": "Highly recommend.  Was nice and friendly and took great care to insure that we got exactly what we needed.",
    "date": "2019-10-24",
    "stars": 5
  },
  {
    "reviewer_name": "Nikki Parrish",
    "text": "I called the morning after my unit went out and there was a repair man at my house within an hour. Very quick and professional! Wonderful service and good pricing, highly recommend",
    "date": "2019-10-04",
    "stars": 5
  },
  {
    "reviewer_name": "Mandy Cox",
    "text": "Called him he was at my house within 30 mins had my air fixed within the hour and you came beat his prices. Definitely  recommend him. You can call him and he will help u any way he can overall awesome",
    "date": "2019-07-07",
    "stars": 5
  },
  {
    "reviewer_name": "Jonathan Shick",
    "text": "Very friendly and would recommend. Thanks again!",
    "date": "2019-07-07",
    "stars": 5
  },
  {
    "reviewer_name": "Cody Oldham",
    "text": "My family has dealt with MSHA since they opened. They came out and fixed the issue on site and for a better price than we had even been quoted. The work was great and fast and we have had no issues since. I would highly recommend MSHA to anyone!",
    "date": "2019-07-05",
    "stars": 5
  },
  {
    "reviewer_name": "Bradley Burns",
    "text": "Great service, came out ,very positive  ,I was told by other ac companies that i need a new unit, he came and checked my system and it was a just a bad connection, saved me thousands of dollars .  Thank you very much",
    "date": "2019-07-05",
    "stars": 5
  },
  {
    "reviewer_name": "Angela Dorsey",
    "text": "Great work. Fast responce time. Reasonable pricing. Will definitely use them again.",
    "date": "2019-07-05",
    "stars": 5
  },
  {
    "reviewer_name": "Shelley Hale",
    "text": "Very helpful and honest person!",
    "date": "2019-05-26",
    "stars": 5
  },
  {
    "reviewer_name": "Tj Williams",
    "text": "Great work! Good prices! Best around!!!",
    "date": "2019-04-02",
    "stars": 5
  },
  {
    "reviewer_name": "Amanda Horton",
    "text": "Very realible, friendly service. The  job is always complete and done right! Definitely recommend their services and the prices can't be beat !",
    "date": "2019-04-02",
    "stars": 5
  },
  {
    "reviewer_name": "Mars The Menace",
    "text": "Nice guy and it didn't take him long either 👌👌",
    "date": "2019-04-02",
    "stars": 5
  },
  {
    "reviewer_name": "Shane Baldwin",
    "text": "Had a fan quit working on an older model air handler. Aaron was there within 15 minutes and had everything fixed and back up and running that afternoon. Would definitely recommend him to anyone.",
    "date": "2019-01-24",
    "stars": 5
  },
  {
    "reviewer_name": "Sheila Overton",
    "text": "Aaron was very prompt, professional, and honest fixing our unit at a reasonable price. We will call him again for any heat and air problems",
    "date": "2018-12-04",
    "stars": 5
  },
  {
    "reviewer_name": "Karen Miller",
    "text": "He came and fixed my system after hours and worked with me on the price. I would definitely use midsouth again.",
    "date": "2018-11-08",
    "stars": 5
  },
  {
    "reviewer_name": "Jeff Clay",
    "text": "Aaron has done a great job keeping our heat and air system running strong. He's very prompt, polite and knowledgeable.",
    "date": "2018-11-08",
    "stars": 5
  },
  {
    "reviewer_name": "Dottie Wikowsky",
    "text": "We called Aaron (owner of Mid-South Heat & Air.  He came out that day and fix our air.  Great job.  He was helpful and informative.  We will call again if we need service",
    "date": "2018-10-19",
    "stars": 5
  },
  {
    "reviewer_name": "Matt Lawrence",
    "text": "Great customer service and reasonable pricing.",
    "date": "2018-10-07",
    "stars": 5
  },
  {
    "reviewer_name": "Richard JarJar Ortiz",
    "text": "Great family owned business keep up the good work Aaron...",
    "date": "2018-10-04",
    "stars": 5
  },
  {
    "reviewer_name": "slade reed",
    "text": null,
    "date": "2018-10-03",
    "stars": 5
  },
  {
    "reviewer_name": "jesse ivy",
    "text": null,
    "date": "2018-10-02",
    "stars": 5
  },
  {
    "reviewer_name": "Angela burns",
    "text": "Great service! Will use again!",
    "date": "2018-10-02",
    "stars": 5
  },
  {
    "reviewer_name": "Maal",
    "text": "I needed my A/C unit worked on during the hottest month of the year. They came out & put some electrical tape on my outside unit. My indoor unit is still leaking. They said they would get back to me about resolving the issues & never did. Just stopped answering my calls & emails. I’ve truly never been more disappointed. If you are looking for professionalism & customer service, I don’t think you will find it here.",
    "date": "2024-09-30",
    "stars": 1
  },
  {
    "reviewer_name": "Phyllis Stone",
    "text": "Came to the house on Saturday afternoon , we called and they called back very quick about fixing our air conditioning unit . The young was very knowledgeable about the matter and told us it wasn’t the air conditioner it was something to do with the electric coming into our house. Very nice young man that we would recommend and will us them again when needed.",
    "date": "2024-06-01",
    "stars": 5
  },
  {
    "reviewer_name": "Brian Etheridge",
    "text": "The best service I've had since owning the home of ten + years. Thanks. And your company will be recommended in the future.",
    "date": "2024-05-17",
    "stars": 5
  },
  {
    "reviewer_name": "Stefani May",
    "text": "Answer phone quickly,reasonable, professional, did a great job on putting new duct system. Recommend them to anyone that needs service.",
    "date": "2024-03-29",
    "stars": 5
  },
  {
    "reviewer_name": "tammy anderson",
    "text": null,
    "date": "2024-03-05",
    "stars": 5
  },
  {
    "reviewer_name": "Beth Davis",
    "text": "Called him he immediately fixed my brothers hot water heater within the hour he was very professional bought everything took old water heater off answered the phone quickly I couldn’t ask for any better service period I highly recommend him!!!",
    "date": "2024-02-22",
    "stars": 5
  },
  {
    "reviewer_name": "Dawn Ferguson",
    "text": "They were very polite, professional and prompt to respond to in home call.\nI would Definitely call them again if I had any troubles",
    "date": "2023-11-01",
    "stars": 5
  },
  {
    "reviewer_name": "Zack Rodgers",
    "text": "Called for my AC going out. They got to the house in an impressive timely manner. Very professional and had the issue fixed within no time. Will definitely use thier services in the future and highly recommend them to anyone. Very cost friendly as well.",
    "date": "2023-06-05",
    "stars": 5
  },
  {
    "reviewer_name": "Coleman James",
    "text": "These guys were fast, efficient, and reasonable. And they actually answer their phone, which is rare around here. They fixed my water heater in no time. Awesome job; highly recommended.",
    "date": "2023-03-02",
    "stars": 5
  },
  {
    "reviewer_name": "Jillian Taylor",
    "text": "Incredible young man! Very honest and reliable.",
    "date": "2024-09-20",
    "stars": 5
  },
  {
    "reviewer_name": "Johnny Birdsong",
    "text": "Never returned call",
    "date": "2024-11-20",
    "stars": 1
  },
  {
    "reviewer_name": "Dusten Lee",
    "text": "Quick and fast gets in and gets out and get the job done right",
    "date": "2024-06-18",
    "stars": 5
  },
  {
    "reviewer_name": "Tina Hefner",
    "text": "Brad King is a very good and honest plumber...get the job done right the first time...",
    "date": "2018-02-02",
    "stars": 5
  },
  {
    "reviewer_name": "C Raanes",
    "text": "This man took 1800.00 and ran. Never finished the job. I have been with out heat and hot water for 3 weeks. No body else will touch his work. I am going to have to pull out my gas hot water heater and my gas furnace and run all new electric because of this man. Do not use him",
    "date": "2023-10-19",
    "stars": 1
  },
  {
    "reviewer_name": "Anonymous",
    "text": "",
    "date": "Unknown date",
    "stars": 0
  },
  {
    "reviewer_name": "Kelbe Dowler",
    "text": null,
    "date": "2023-06-19",
    "stars": 5
  },
  {
    "reviewer_name": "Bobby Williams",
    "text": "Great service",
    "date": "2022-07-12",
    "stars": 5
  },
  {
    "reviewer_name": "Robert Brannan",
    "text": null,
    "date": "2019-11-23",
    "stars": 5
  },
  {
    "reviewer_name": "Tierre Hamilton",
    "text": null,
    "date": "2019-08-30",
    "stars": 5
  },
  {
    "reviewer_name": "Roy O'Neal",
    "text": null,
    "date": "2019-03-17",
    "stars": 1
  },
  {
    "reviewer_name": "Anonymous",
    "text": "",
    "date": "Unknown date",
    "stars": 0
  },
  {
    "reviewer_name": "Kevin Ross",
    "text": "Very affordable great work and in good time. Would use again and recommend to anyone.",
    "date": "2022-04-26",
    "stars": 5
  },
  {
    "reviewer_name": "Zaiden Kent",
    "text": null,
    "date": "2022-04-07",
    "stars": 5
  },
  {
    "reviewer_name": "Missouri Home Inspections by Clinton Carter",
    "text": "Excellent work remodeling and tiling  the shower and bathroom and great at communicating along with being on time and getting the job done! Definitely recommend!",
    "date": "2022-01-05",
    "stars": 5
  },
  {
    "reviewer_name": "Jason Stricklin",
    "text": null,
    "date": "2021-10-23",
    "stars": 5
  },
  {
    "reviewer_name": "Matthew Tribble",
    "text": "They was very respectful. They got the job done very fast and it looked amazing. This is the only people I will call from now on.",
    "date": "2021-08-16",
    "stars": 5
  },
  {
    "reviewer_name": "Betsy Yancey",
    "text": "very professional helped with all that was stopped up! ! Thanks I will call you for all my plumbing needs!",
    "date": "2025-02-11",
    "stars": 5
  },
  {
    "reviewer_name": "Brittany Edwards",
    "text": "Very professional worked hard cleaned up after themselves. Did a very good job",
    "date": "2025-02-11",
    "stars": 5
  },
  {
    "reviewer_name": "Jessica Guth",
    "text": "Mr Edward's came out to fix my washer drain. He was very fast and professional!  Very reasonable rates!   Both him and the guy helping him were very friendly!  I'd definitely recommend his business to anyone!",
    "date": "2025-01-28",
    "stars": 5
  },
  {
    "reviewer_name": "Dallis Chuter",
    "text": "He came out on Sunday night in 20 degree weather and fixed my problem didn't take long to do the work",
    "date": "2025-01-20",
    "stars": 5
  },
  {
    "reviewer_name": "Jacob Reaves",
    "text": "Great job at a fair price!  Good communication about what was done.   Helped manage my tenants expectation in the future. Thanks!",
    "date": "2025-01-14",
    "stars": 5
  },
  {
    "reviewer_name": "Yvonne Cliatt",
    "text": "Brandon and the guys at Drain Pro are the best. They show up when you need them and do whatever is necessary to help you! They are awesome! Yvonne from CubeSmart in Marion on I-55 Access Rd 😉👍",
    "date": "2025-01-13",
    "stars": 5
  },
  {
    "reviewer_name": "farrukh abbasi",
    "text": "He fix my water heater while it was in a car trunk. He did a good job while its snow plus Saturday. Thank you Sir really appreciated.",
    "date": "2025-01-11",
    "stars": 5
  },
  {
    "reviewer_name": "chris secrease",
    "text": "Very helpful & knowledge with trouble shooting fixing my hot water heater.",
    "date": "2025-01-10",
    "stars": 5
  },
  {
    "reviewer_name": "Bobby Robert Brown",
    "text": "Drainpro Professional are the go people to go  if you want your plumbing done the right way kitchen problem bath or busted pipes\nproblem done professional name speaks for itself recommend anyone having these problems amen to\nthe pro's Bobby",
    "date": "2025-01-04",
    "stars": 5
  },
  {
    "reviewer_name": "David Teague",
    "text": "Very helpful and knowledgeable. Would recommend to anyone needing plumbing services.",
    "date": "2025-01-03",
    "stars": 5
  },
  {
    "reviewer_name": "Seth Moon",
    "text": "DrainPro Professional Services are very professional, quick, and highly knowledgeable about their profession. We would highly recommend them, as they are always honest and fair in their prices and work.",
    "date": "2025-01-03",
    "stars": 5
  },
  {
    "reviewer_name": "Melanie New",
    "text": "I am above and beyond impressed with this company’s professional service! Brandon is obviously an expert in his field displaying excellent customer service skills, work ethic and trustworthy values!",
    "date": "2025-01-01",
    "stars": 5
  },
  {
    "reviewer_name": "Franco Cabada",
    "text": "I can’t express how great of a service he provided, I had a slab/foundation leak, where the pipe was busted and leaked water onto our floor, he had all the tools for the job. Told me he would be here on a Tuesday, and got the job done the same day. Very helpful and true! Very reasonable prices!",
    "date": "2025-01-01",
    "stars": 5
  },
  {
    "reviewer_name": "Wally Lee",
    "text": "Use this service today for an issue with water pressure in bath tub. They were able to fix my issue plus correct 6 other issues the remodel crew messed up. If you want the job done right give them a call. They are the best.",
    "date": "2024-12-28",
    "stars": 5
  },
  {
    "reviewer_name": "Adela Herrera",
    "text": null,
    "date": "2024-12-28",
    "stars": 5
  },
  {
    "reviewer_name": "Doris Penter",
    "text": "I had a fitting busted due to years of being installed from building the house 28 years ago  I called today and it was fixed within the hour of them coming today.  Great job they did, I gave a 5 star review. I am so proud I called them. I will call again if I need a plumber. Thanks Doris",
    "date": "2024-12-26",
    "stars": 5
  },
  {
    "reviewer_name": "Tracy Meadows",
    "text": "Great job! Professional, trustworthy, quality work. You cant go wrong with Drainpro.\n\nI'm adding this to this review. I developed  a problem and true to his word, Brandon came out AFTER DARK, in 39 degrees, and fixed the problem. Brandon is a man of his word, and he can be relied on when you need help. Thanks, Brandon!",
    "date": "2024-12-26",
    "stars": 5
  },
  {
    "reviewer_name": "Felicia Ragland",
    "text": "Had a leak and he came over in 40 degree weather and in the rain and got it fixed within an hour! Great service would highly recommend!",
    "date": "2024-12-17",
    "stars": 5
  },
  {
    "reviewer_name": "Connor 72",
    "text": null,
    "date": "2024-12-16",
    "stars": 5
  },
  {
    "reviewer_name": "Jonathan Williams",
    "text": "The best around got to me in in a very good timely manner had me fixed in minutes. Very good service and very kind, generous, helping people 10/10 recommend them best prices around as well!",
    "date": "2024-12-12",
    "stars": 5
  },
  {
    "reviewer_name": "Blue_Nexus_",
    "text": "Great service, quick and easy",
    "date": "2024-12-11",
    "stars": 5
  },
  {
    "reviewer_name": "Winston Beesinger",
    "text": "Great experience. Would call again",
    "date": "2024-12-10",
    "stars": 5
  },
  {
    "reviewer_name": "tom perrine",
    "text": "Came out and explained what the problem was and saved a lot of money.",
    "date": "2024-11-27",
    "stars": 5
  },
  {
    "reviewer_name": "Keiron",
    "text": "Very professional took the time to explain the problem and was very good on his prices would highly recommend 10/10 service",
    "date": "2024-11-27",
    "stars": 5
  },
  {
    "reviewer_name": "Alan Price",
    "text": "I had a bad backup at my home. I called Brandon at 8pm, he was nothing but helpful. He told me what to try, who to call at the city to try and get my lines flushed. Great guy should be your first call!!!",
    "date": "2024-11-23",
    "stars": 5
  },
  {
    "reviewer_name": "Jacob Breytspraak",
    "text": "DrainPro plumbing took care of us without a doubt! They were professional and very reasonable! They will be my go to for all other plumbing needs! I give these guys a 5 star without a doubt!",
    "date": "2024-09-20",
    "stars": 5
  },
  {
    "reviewer_name": "Felicia Ragland",
    "text": "They did amazing! Went above and beyond with their work! Great prices and would highly recommend them for any of your plumbing needs. Always informed me of what was going on also",
    "date": "2024-09-12",
    "stars": 5
  },
  {
    "reviewer_name": "Mike Ring",
    "text": "Me and my cousin had a stopped up kitchen sink for almost a week. After calling and calling several different services I stumbled upon DrainPro. In short, it's the best stumble I've ever made. Brandon knows his stuff and is proficient in every sense of the word. Will definitely be calling him for any future plumbing problems. More than reasonable pricing. Did a simple job that Nuckles & Son couldn't. Or rather wouldn't and still charged us. Thank you so much Brandon",
    "date": "2024-07-23",
    "stars": 5
  },
  {
    "reviewer_name": "Linda Jones",
    "text": "Brandon fixed our miss up right away. Just 1 phone call and he came to fix our shower. Thank you so much.",
    "date": "2024-06-30",
    "stars": 5
  },
  {
    "reviewer_name": "michael witt",
    "text": "showed up same day. Was very professional  and solved my problem. Will def use them for all plumbing needs in the future.",
    "date": "2024-06-19",
    "stars": 5
  },
  {
    "reviewer_name": "Ainsley Wright",
    "text": "We were first time customers and called Brandon around 11:30 am. He had someone at our house at 12:50 pm the same day! Talk about fast! The workers were so nice and helpful, showed me everything they did and had us up and running within ten minutes! We will absolutely being using Brandon's services for all of our plumbing needs!",
    "date": "2024-06-14",
    "stars": 5
  },
  {
    "reviewer_name": "Clay Wright",
    "text": "DrainPro came and helped us with our problems and had them fixed in no time. Great service all around.",
    "date": "2024-06-14",
    "stars": 5
  },
  {
    "reviewer_name": "Brian Daniel",
    "text": "First time customer. They were top notch professionals with excellent customer service. Actually listened to my issue and had it resoved without hesitation.  I now have a plumber for as long as DrainPro is plumbing and so should you!",
    "date": "2024-06-06",
    "stars": 5
  },
  {
    "reviewer_name": "Venus Whitehurst",
    "text": "I called him at 2am and he picked up. Came the next afternoon. Now what had to be done he couldn't fix because it ran off my property but he walked me through the entire process and helped me find who I needed to to get it fix. He is the only plumber we will ever use again!\n\n05/17/2024\nHad to call again for a new problem. This man and his crew came out again in a timely manner. Didn't charge much at all. Very friendly and respectful. Walked me through the process and talked to the water company. They are the only plumber that will come out to Lake City Arkansas. 10/10. Will call every time I have a plumbing problem!",
    "date": "2024-05-17",
    "stars": 5
  },
  {
    "reviewer_name": "Dillon H",
    "text": "Have used them twice and each time they were out here within 30 minutes. They were professional and courteous. If you need a plumber you should call these guys.",
    "date": "2024-04-11",
    "stars": 5
  },
  {
    "reviewer_name": "Donnie Battles",
    "text": "Brandon and his workers are top tier when it comes to service and customer care. They are nothing but professionals. I'm a new homeowner and I will not call anyone else.",
    "date": "2024-04-05",
    "stars": 5
  },
  {
    "reviewer_name": "Edward Yarbrough",
    "text": "I would highly recommend Brandon and Drain Pro. They go above and beyond on a regular basis and provide superior work and superior customer service. If you need a plumber, look no further. He has always done great work for me.",
    "date": "2024-03-25",
    "stars": 5
  },
  {
    "reviewer_name": "Amber Fahr",
    "text": "They stayed until the job was done and pricing was reasonable! Quality work..great company and the owner is very friendly and courteous",
    "date": "2024-03-22",
    "stars": 5
  },
  {
    "reviewer_name": "C&B Legacy LLC",
    "text": "We have used Brandon numerous times across several properties. He goes above and beyond and makes sure that the job is done right every single time.\nAs long as we can help it, we will never use any other plumber.",
    "date": "2024-03-15",
    "stars": 5
  },
  {
    "reviewer_name": "ryan richardson",
    "text": "Called on Saturday morning and arrived 45 minutes later.  Awesome job!",
    "date": "2024-02-24",
    "stars": 5
  },
  {
    "reviewer_name": "Matthew Smithey",
    "text": "This man worked wonders my busted water line was dug up, quoted, and replaced all within two days. From start to finish there wasn’t one time I thought to give them any less than a five star rating. With a combined knowledge and work ethic I will be using them and suggesting them for years to come.",
    "date": "2024-02-15",
    "stars": 5
  },
  {
    "reviewer_name": "Antonio Taylor",
    "text": "I called and talked to Brandon and he told me exactly what to do to unclog my pipe. He possibly save me from spending $1000s. I would recommend anybody that have any plumbing problems to give them a call FIRST. Fast, friendly and and very honest people.\n\nUpdate a year later... Very very good honest guy. Came back to my house and found the problem instantly.",
    "date": "2024-02-05",
    "stars": 5
  },
  {
    "reviewer_name": "Becky Watkins",
    "text": "Pipe burst due to being on outside wall in super cold weather. Brandon came out quickly and fixed it perfectly. Even got hot water to my washing machine that I haven’t had in a while. All while fielding a ton of calls from other customers with issues and promising them he’d do whatever it took to get them back to normal asap! Price was very reasonable and they were super friendly and professional! Definitely recommend and will use if I have any other problems in the future!",
    "date": "2024-01-19",
    "stars": 5
  },
  {
    "reviewer_name": "Melvin Dycus",
    "text": "Brandon was very professional and worked me into his busy schedule as soon as possible. Very pleased with the work and results. Thank you",
    "date": "2023-12-20",
    "stars": 5
  },
  {
    "reviewer_name": "Alex Mueller",
    "text": "Brandon and Cory both came out late at night to resolve a drainage issue in my house that we were trying to move back into.\n\nThese guys were quick, knowledgeable, and did an amazing job. Would highly recommend them to anyone that has a plumbing issue.",
    "date": "2023-12-14",
    "stars": 5
  },
  {
    "reviewer_name": "trissy furlong",
    "text": "Brandon is the owner and always answers the phone. His willingness to further your knowledge on your homes plumbing is one of the biggest reason I can not wait to have him working on our home. He was attentive to answering even on a Saturday evening which we truly appreciate. Look forward to having him fix other plumbing needs at have and updating my review when pictures.  Thank you Brandon.",
    "date": "2023-11-19",
    "stars": 5
  },
  {
    "reviewer_name": "John Green",
    "text": "I had these guys do the whole sewer drain from house to main. They kept appointment and really pushed thru unforeseen problems at the city's main connection which should have been the city's responsibility but Brandon took care of it to get the job done as we all know how the city will drag their feet. He kept his word and stuck to the quote. Very good plumbing company to do business with.",
    "date": "2023-11-10",
    "stars": 5
  },
  {
    "reviewer_name": "Ricky Hill",
    "text": "Brandon is an expert in his trade and is super friendly. He not only does the job right, but is happy to educate you on the process. His plumbing service is the one I'll be using from now on.",
    "date": "2023-09-22",
    "stars": 5
  },
  {
    "reviewer_name": "Bionca Bishop",
    "text": "Went above and beyond what was asked! Not only did I get my issue fixed but also got a lot of useful info and tips of fixing other issues. Mr Brandon is the most professional and caring plumber I’ve ever dealt with in my life",
    "date": "2023-09-17",
    "stars": 5
  },
  {
    "reviewer_name": "Jim evans",
    "text": "The most courteous,  professional, knowledgeable  plumber I've ever had the pleasure of doing business with. Went beyond my expectations is resolving major sewer issue. Helped in tracking down guilty party on the sewer issue, spending many hours on the phone.  Highly recommend this honest guy for any plumbing problem ,major or minor, that you may have",
    "date": "2023-09-11",
    "stars": 5
  },
  {
    "reviewer_name": "Anonymous",
    "text": "",
    "date": "Unknown date",
    "stars": 0
  },
  {
    "reviewer_name": "Jordain Coffey",
    "text": null,
    "date": "2023-05-13",
    "stars": 5
  },
  {
    "reviewer_name": "Bible reading, Songs, and More",
    "text": null,
    "date": "2023-05-12",
    "stars": 5
  },
  {
    "reviewer_name": "Tori Pestel",
    "text": "Great work Guaranteed, with great prices. Excellent customer service and satisfaction! Wide range of skills from electrical to plumbing, remodeling to repairs and mechanic skills!",
    "date": "2023-05-12",
    "stars": 5
  },
  {
    "reviewer_name": "Natashia Hilentzaris",
    "text": "When I say these folks can DO ANYTHING, I MEAN IT!!\nFrom the plumbing work, to the emergency electrical work I needed for my business, PENNINGTONS WAS THERE FOR ME!\nDon’t take my word for it, try it yourself, YOU WONT BE DISAPPOINTED!\nThank you PENNINGTONS CREATIVES!!",
    "date": "2023-05-12",
    "stars": 5
  }
]